mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
/* #################################################################################################
 *
 *      Name: ESP32_SPI Module
 *  Function: This is used to set up GPIOs as a switch with the goal to control switching hardware
 *            (relay, ...). The GPIO switching is Hardware PWM driven (for ESP32 SOC only). 
 *            Module for use with SCDE (Smart Connected Device Engine) only !
 *
 *  ESP 8266EX & ESP32 SoC Activities ...
 *  HoME CoNTROL & Smart Connected Device Engine Activities ...
 *  Copyright by EcSUHA
 *
 *  Created by Maik Schulze, Sandfuhren 4, 38448 Wolfsburg, Germany for EcSUHA.de 
 *
 *  MSchulze780@GMAIL.COM
 *  EcSUHA - ECONOMIC SURVEILLANCE AND HOME AUTOMATION - WWW.EcSUHA.DE
 * #################################################################################################
 *
 *
 */
#include "stdatomic.h"

//define mySPI ESP32_SPI KEY=ARG


#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>

// the Smart-Connected-Device-Engine structures & types ..
#include <SCDE_s.h>

// provides WebIf, need the structures & types ...
#include "WebIf_Module.h"

// this Modules structures & types ...
#include "ESP32_SPI_Module_s.h"
#include "ESP32_SPI_Module.h"

// -------------------------------------------------------------------------------------------------

// set default build verbose - if no external override
#ifndef ESP32_SPI_Module_DBG  
#define ESP32_SPI_Module_DBG  5	// 5 is default
#endif 

// -------------------------------------------------------------------------------------------------






//#include "SCDE_Main.h"
//#include "driver/gpio.h"




// ptr zur Fehlermeldung in allokierter strTextMultiple_t WENN NOCH KEIN FEHLER WAR
//#define SCDE_OK  NULL

/*
static const char* I2S_TAG = "I2S";
#define SCDE_CHECK(a, str, ret) if (!(a)) {                                              \
        ESP_LOGE(I2S_TAG,"%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str);       \
        return (ret);                                                                   \
        }
//  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
*/



// SCDE_CHECK MAKRO: Prüft Bedingung und gibt Fehler in allokierter strTextMultiple_t zurück
#define SCDE_CHECK(a, str) if (!(a)) {							\
	retMsg = malloc(sizeof(strTextMultiple_t));					\
	retMsg->strTextLen = asprintf(&retMsg->strText					\
		,"Error! '%s'"								\
		,str);									\
	return retMsg;									\
	}






























// macro to CHECK, if FALSE -> load error msg in strTextMultiple_t and return
#define SCDE_CHECK_LOAD_ERROR_TEXT_GOTO(a, str, dest) do {			\
  if (!(a)) {									\
	/* alloc mem for retMsg */						\
	p_retMsg = malloc(sizeof(strTextMultiple_t));				\
										\
	/* response with error text */						\
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText			\
		,"Parsing Error! %s(%d): %s!",					\
		__FUNCTION__, __LINE__, str);					\
	goto dest;								\
  }										\
} while(0)






// macro to CHECK, if FALSE -> load error msg in strTextMultiple_t and return
#define SCDE_CHECK_LOADERRORTXT_RET(a, str) do {				\
  if (!(a)) {									\
	/* alloc mem for retMsg */						\
	retMsg = malloc(sizeof(strTextMultiple_t));				\
										\
	/* response with error text */						\
	retMsg->strTextLen = asprintf(&retMsg->strText				\
		,"Parsing Error! %s(%d): %s!",					\
		__FUNCTION__, __LINE__, str);					\
	return retMsg;								\
  }										\
} while(0)

// macro to CHECK, if FALSE -> load error msg in strTextMultiple_t and return
#define SCDE_CHECK_LOADERRORTXT_RET2(a, str, ...) do {				\
  if (!(a)) {									\
	/* alloc mem for retMsg */						\
	retMsg = malloc(sizeof(strTextMultiple_t));				\
										\
	/* response with error text */						\
	retMsg->strTextLen = asprintf(&retMsg->strText				\
		,"Parsing Error! %s(%d): "str,					\
		 __FUNCTION__, __LINE__, ##__VA_ARGS__);			\
	return retMsg;								\
  }										\
} while(0)

// macro to CHECK, if FALSE -> only load error msg in strTextMultiple_t and NO! return
#define SCDE_CHECK_LOADERRORTXT(a, str) do {					\
  if (!(a)) {									\
	/* alloc mem for retMsg	 */						\
	retMsg = malloc(sizeof(strTextMultiple_t));				\
										\
	/* response with error text */						\
	retMsg->strTextLen = asprintf(&retMsg->strText				\
		,"Parsing Error! %s(%d): %s!",					\
		__FUNCTION__, __LINE__, str);					\
  }										\
} while(0)




























#include <WebIf_EspFSStdFileTX.h>
#include <WebIf_EspFSAdvFileTX.h>

#include "HTools_cgi.h"
#include <ServAPCfg_tpl.h>
#include <CGI_Redirect.h>



// -------------------------------------------------------------------------------------------------



/*
 * Implemented Values for Keys
 */

// ESP32_SPI_SET_DISENA -> 'SDA_IO_PULLUP' -> Disabled|Enabled
//                             -> 'SCL_IO_PULLUP' -> Disabled|Enabled
SelectAData ESP32_SPI_DisEna[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Disabled"},
  {1,"Enabled"}, 
  {0, NULL}
  };

// ESP32_SPI_SET_I2C_MODE -> 'I2C_MODE' -> Master|Slave
SelectAData ESP32_SPI_I2C_MODE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Master"},
  {1,"Slave"}, 
  {0, NULL}
  };

/*
// ESP32_SPI_SET_IDLE_LV -> 'IDLE_LV' -> Low|High
SelectAData ESP32_SPI_LoHi[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Low"},
  {1,"High"}, 
  {0, NULL}
  };
// ESP32_SPI_SET_BLOCK -> 'PWM_BLOCK'-> High_Speed|Low_Speed
SelectAData ESP32_SPI_PWM_BLOCK[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"High_Speed"},
  {1,"Low_Speed"},
  {0, NULL}
  };
// ESP32_SPI_SET_TICK_SOURCE -> 'TICK_SOURCE'-> REF|APB_SLOW
SelectAData ESP32_SPI_TICK_SOURCE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"REF"},
  {1,"APB_SLOW"}, 
  {0, NULL}
  };
*/



/**
 * For Type: ESP32_SPI
 * Implemented-Args-Keys, for input (MAX 64!). //IAK!!
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in ESP32_SPI_parsedKVInput_t
 */
enum ESP32_SPI_SET_IK {				// Bit #XX for debugging

