mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
  // ### Service Access Point Cfg ###
 ,{( 6<<16) +	0b0000000000000010,	WebIf_EspFSAdvFileTX,	ServAPCfg_tpl	}
 ,{( 6<<16) +	0b0000000000000100,	NULL,NULL}//	ServAPCfg_cgi,		NULL		}
 ,{( 6<<16) +	0b0000000000001000,	NULL,NULL}//	ServAPCfg_jso,		NULL		}

  // ### TimeStamp Cfg ###
 ,{( 7<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	TiStCfg_tpl	}
 ,{( 7<<16) +	0b0000000000000100,	NULL,NULL}//	TiStCfg_cgi,		NULL		}
 ,{( 7<<16) +	0b0000000000001000,	NULL,NULL}//	TiStCfg_jso,		NULL		}

  // ### Firmware Update ###
 ,{( 8<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	FirmwareUd_tpl	}
 ,{( 8<<16) +	0b0000000000000100,	NULL,NULL}//	FirmwareUd_cgi,		NULL		}
 ,{( 8<<16) +	0b0000000000001000,	NULL,NULL}//	FirmwareUd_jso,		NULL		}

  // ### Redirects ###
 ,{( 9<<16) +	0b0000000000000001,	cgiRedirect,	"/WiFi/QConnect.htm"		}
 ,{(10<<16) +	0b0000000000000001,	cgiRedirect,	"/CoNTROL_8S-1C-1ADC.htm"	}
 ,{(10<<16) +	0b0000000000000010,	cgiRedirect,	"/CoNTROL_8S-1C-1ADC.htm"	}

  // ### Secret services ###
 ,{(11<<16) +	0b0000000000100000,	ReadFullFlash_cgi,	NULL		}		//.bin
 ,{(12<<16) +	0b0000000000100000,	NULL,NULL}//	WriteFileSystem_cgi,	NULL		}		//.bin

  };



// -------------------------------------------------------------------------------------------------



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_SPI_provided_Fn
 *  Desc: Assigns common + custom functions this Module provides to the SCDE (and client Modules)
 *  Data: ESP32_SPI_provided_fn_t
 * -------------------------------------------------------------------------------------------------
 */
ESP32_SPI_ProvidedByModule_t ESP32_SPI_ProvidedByModule = {   // A-Z order
{
// --- first the common module functions ---
  "ESP32_SPI",		// Type-Name of module -> on Linux libfilename.so !
  9,						// size of Type-Name

  NULL,						// Add
  ESP32_SPI_Attribute,				// Attribute
  ESP32_SPI_Define,				// Define
  NULL, 					// Delete
  NULL, 					// DirectRead
  NULL,						// DirectWrite
  NULL,						// Except
  NULL,						// Get
  ESP32_SPI_IdleCb,				// IdleCb
  ESP32_SPI_Initialize,				// Initialize
  NULL,						// Notify
  NULL,						// Parse
  NULL,						// Read
  NULL,						// Ready
  NULL,						// Rename
  ESP32_SPI_Set,				// Set
  ESP32_SPI_Shutdown,				// Shutdown
  NULL, 					// State
  NULL, 					// Sub
  ESP32_SPI_Undefine,				// Undefine
  ESP32_SPI_Write,				// Write
  NULL,						// FnProvided
  sizeof(ESP32_SPI_Definition_t)		// Modul specific Size (Common_Definition_t + X)
},
// --- now the custom module fuctions ---
   ESP32_SPI_bus_add_device,			// adds an device to the definitions host
   ESP32_SPI_bus_remove_device,			// removes an device from the definitions host
   ESP32_SPI_device_queue_trans,		// to queue an interrupt driven transaction
   ESP32_SPI_device_get_trans_result,		// to get result of an interrupt driven transaction
   ESP32_SPI_device_transmit,			// to send transaction, waits to complete, return result
   ESP32_SPI_device_polling_start,		// to immediately start a polling transaction
   ESP32_SPI_device_polling_end,		// to poll until the transaction ends
   ESP32_SPI_device_polling_transmit,		// send polling transaction, wait, return result
   ESP32_SPI_device_acquire_bus,		// to occupy the SPI bus for transactions on a device
   ESP32_SPI_device_release_bus,		// to release the occupied SPI bus 
   ESP32_SPI_cal_clock,				// to calculate the working frequency
   ESP32_SPI_get_timing,			// to calculate the timing settings of specified freq.
   ESP32_SPI_get_freq_limit			// to get the frequency limit of current configuration
};



/* -------------------------------------------------------------------------------------------------
 *  FName: Attribute Fn
 *  Desc: Informs an 'definition' of this 'module' for 'attribute' activities (set/delete)
 *  Info: 'attr_cmmand' is the command for the activity: set, delete
 *        'attr_name' is the attribute name
 *        'attr_value' is the attribute value
 *  Para: Common_Definition_t* p_entry_definition -> the 'definition' identified for the activities
 *	  const String_t attr_command -> the attribute-command
 *	  const String_t attr_name -> the attribute-name
 *	  const String_t attr_value -> the attribute-value
 *  Rets: Entry_String_t* -> = SCDE_OK (no ret msg) or VETO (SLTQ Entry_String_t* with ret msg)
 * -------------------------------------------------------------------------------------------------
 */
Entry_String_t* ICACHE_FLASH_ATTR
ESP32_SPI_Attribute(Common_Definition_t* p_entry_definition,
	 const String_t attr_command,
	 const String_t attr_name,
	 const String_t attr_value)
{
  // make common ptr to modul specific ptr
  ESP32_SPI_Definition_t* p_entry_esp32_spi_definition =
		  (ESP32_SPI_Definition_t*) p_entry_definition;

  // to store the ret_msg. SCDE_OK = no msg 
  Entry_String_t* p_entry_ret_msg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_SPI_Module_DBG >= 5
  SCDEFn_at_ESP32_SPI_M->Log3Fn(p_entry_esp32_spi_definition->common.name,
	p_entry_esp32_spi_definition->common.nameLen,
	5,
	"Attribute Fn (Module '%.*s') is called with args: "
	"attr_command '%.*s' attr_name '%.*s' attr_value '%.*s'",
	p_entry_esp32_spi_definition->common.module->provided->typeNameLen,
	p_entry_esp32_spi_definition->common.module->provided->typeName,attr_command.len,
	attr_command.p_char,
  	attr_name.len,
	attr_name.p_char,
	attr_value.len,
	attr_value.p_char);
  #endif

// ------------------------------------------------------------------------------------------------

  return p_entry_ret_msg;
}








/*
#include "freertos/ringbuf.h"


#include "soc/i2c_struct.h"
#include "soc/i2c_reg.h"
#include "driver/periph_ctrl.h"

static const char* I2C_TAG = "i2c";

#define I2C_CHECK(a, str, ret)  if(!(a)) {                                             \
        ESP_LOGE(I2C_TAG,"%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str);      \
        return (ret);                                                                   \
        }

*/



/** public function
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_SPI_Define
 *  Desc: Finalizes the creation of the requested Definition of this Module. Includes executing type
 *        specific inits.
 *  Info: Invoked by cmd-line 'Define custom_definition_name module_name'
 *  Para: Common_Definition_t* p_Common_Definition -> prefilled 'This'_Module Definition (should be casted)
 *  Rets: strTextMultiple_t* p_retMsg (error text) -> forces VETO! ; NULL = SCDE_OK
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_SPI_Define(Common_Definition_t* p_Common_Definition)
{

  // make common ptr to modul specific ptr
  ESP32_SPI_Definition_t* p_ESP32_SPI_Definition =
		  (ESP32_SPI_Definition_t*) p_Common_Definition;

  // for Fn response msg
  strTextMultiple_t* p_retMsg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_SPI_Module_DBG >= 5
  SCDEFn_at_ESP32_SPI_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	5,
	"DefineFn is called (Module '%.*s'). Creating this Definition with args '%.*s'.",
	p_ESP32_SPI_Definition->common.module->provided->typeNameLen,
	p_ESP32_SPI_Definition->common.module->provided->typeName,
	p_ESP32_SPI_Definition->common.definitionLen,
	p_ESP32_SPI_Definition->common.definition);
  #endif

// ------------------------------------------------------------------------------------------------

  // new conversation
  uint8_t* p_defArgsText = p_Common_Definition->definition;
  size_t defArgsTextLen = p_Common_Definition->definitionLen;

  // Check for args. This type requires args...
  if (!defArgsTextLen) {

	// alloc mem for retMsg
	p_retMsg = malloc(sizeof(strTextMultiple_t));

