mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
	// response with error text
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText
		,"Parsing Error! Expected Args!");

	return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------

//  xSemaphoreTake(p_ESP32_SPI_Definition->def_mux
//    ,portMAX_DELAY);

// ------------------------------------------------------------------------------------------------

  // store FD to Definition. Will than be processed in global loop ... -> THIS MODULE USES NO FD
  p_ESP32_SPI_Definition->common.fd = -1;

  // store table of function callbacks provided & made accessible for client modules
//  p_ESP32_SPI_Definition->ESP32_SPI_Fn = &ESP32_SPI_Fn;

// ------------------------------------------------------------------------------------------------

  // init WebIf_Provided offset
//  ESP32Control_Definition->common.link =
//	&ESP32Control_Definition->WebIf_Provided;

  // check for loaded Module 'WebIf' -> get provided Fn
  p_ESP32_SPI_Definition->WebIf_Provided.WebIf_FnProvided =
	NULL;//(WebIf_FnProvided_t *) SCDEFn_at_ESP32_SPI_M->GetFnProvidedByModule("WebIf");

 // Providing data for WebIf? Initialise data provided for WebIf
  if (p_ESP32_SPI_Definition->WebIf_Provided.WebIf_FnProvided) {

	p_ESP32_SPI_Definition->WebIf_Provided.ActiveResourcesDataA =
		(WebIf_ActiveResourcesDataA_t *) &ESP32_SPI_ActiveResourcesDataA_forWebIf;

	p_ESP32_SPI_Definition->WebIf_Provided.ActiveResourcesDataB =
		(WebIf_ActiveResourcesDataB_t *) &ESP32_SPI_ActiveResourcesDataB_forWebIf;
  }

  else	{

	SCDEFn_at_ESP32_SPI_M->Log3Fn(p_Common_Definition->name
		,p_Common_Definition->nameLen
		,1
		,"Could not enable WebIf support for '%.*s'. Type '%.*s' detects Type 'WebIf' is NOT loaded!"
		,p_ESP32_SPI_Definition->common.nameLen
		,p_ESP32_SPI_Definition->common.name
		,p_ESP32_SPI_Definition->common.module->provided->typeNameLen
		,p_ESP32_SPI_Definition->common.module->provided->typeName);
  }

// ------------------------------------------------------------------------------------------------

  // Parse define-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t* p_parsedKVInput = 
	SCDEFn_at_ESP32_SPI_M->ParseKVInputArgsFn(ESP32_SPI_SET_NUMBER_OF_IK	// Num Implementated KEYs MAX
	,ESP32_SPI_Set_ImplementedKeys						// Implementated Keys
	,p_defArgsText								// our args text
	,defArgsTextLen);							// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!p_parsedKVInput) {

	// alloc mem for retMsg
	p_retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText,
		"Parsing Error! Args '%.*s' not taken! Check the KEYs!",
		defArgsTextLen,
		p_defArgsText);

	if (p_parsedKVInput) {

		free(p_parsedKVInput);
	}

	return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // try 1 - arguments for configuration as i2c master ?

  // set required Keys -> Keys that should be there in this request
  p_parsedKVInput->requiredKVBF = 	( (1 << ESP32_SPI_SET_I2C_NUM)
					| (1 << ESP32_SPI_SET_I2C_MODE)
					| (1 << ESP32_SPI_SET_SDA_IO)
					| (1 << ESP32_SPI_SET_SDA_IO_PULLUP)
					| (1 << ESP32_SPI_SET_SCL_IO)
					| (1 << ESP32_SPI_SET_SCL_IO_PULLUP)
					| (1 << ESP32_SPI_SET_MASTER_CLOCK)
					);

  // set forbidden Keys -> Keys that are not allowed in this request
  p_parsedKVInput->forbiddenKVBF = 	( (1 << ESP32_SPI_SET_SLAVE_10BIT_ENA)
					| (1 << ESP32_SPI_SET_SLAVE_ADRESS)
 					);
/*
  // process the set-args (key=value@) protocol
  p_retMsg = ESP32_SPI_ProcessKVInputArgs(p_ESP32_SPI_Definition,
		p_parsedKVInput,	// KVInput parsed
		p_defArgsText,		// our args text
		defArgsTextLen);	// our args text len*/

  // processing reports an problem. Args not taken. Return with MSG
  if (p_retMsg) {

	// free allocated memory for query result key-field
	free(p_parsedKVInput);

	return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------


// init spi here - MANUAL VALUES for now

/* we need:
REQ:
PIN_NUM_MISO
PIN_NUM_MOSI
PIN_NUM_CLK

opt:
PIN_NUM_QUADWP (Write Protect if used)
PIN_NUM_QUADDH (HolD if used)
MAX_TRANSFER_SIZE (Defaults to 4094 if not assigned)
IRQ_FLAGS ?
*/

// Define which spi bus to use VSPI_HOST or HSPI_HOST, NOT! SPI_HOST
#define SPI_BUS_PHERIPERAL HSPI_HOST

#define PIN_NUM_MISO 19		// SPI MISO
#define PIN_NUM_MOSI 23		// SPI MOSI
#define PIN_NUM_CLK  18		// SPI CLOCK pin



// ------------------------------------------------------------------------------------------------

  // alloc mem for the bus configuration (ESP32_SPI_bus_config_t)
  ESP32_SPI_bus_config_t* p_bus_config =
	malloc(sizeof(ESP32_SPI_bus_config_t));

  // check if we got memory? Else load retMsg an goto NOMEMORY
  SCDE_CHECK_LOAD_ERROR_TEXT_GOTO(p_bus_config,
		"Could not allocate ESP32_SPI_bus_config_t", error_cleanup_1);

  // store the bus config configuration
  p_ESP32_SPI_Definition->p_bus_config = p_bus_config;

  // zero / start clean ESP32_SPI_bus_config_t
  memset(p_bus_config, 0, sizeof(ESP32_SPI_bus_config_t));

  // initial fill ...

  p_bus_config = &(ESP32_SPI_bus_config_t) {
	.miso_io_num = PIN_NUM_MISO,		// set SPI MISO pin
	.mosi_io_num = PIN_NUM_MOSI,		// set SPI MOSI pin
	.sclk_io_num = PIN_NUM_CLK,		// set SPI CLK pin
	.quadwp_io_num = -1,
	.quadhd_io_num = -1,
	.max_transfer_sz = 6 * 1024,		// PARALLEL_LINES*320*2+8
};

// ------------------------------------------------------------------------------------------------

  // Initialize this Definitions SPI bus
  p_retMsg = ESP32_SPI_bus_initialize(p_ESP32_SPI_Definition,	// the Definition which wants a spi host
	SPI_BUS_PHERIPERAL,					// the SPI pheriperal the host uses
	p_bus_config,						// the bus configuration of the pheriperal
	1);

