mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
  // an error occured, deinit, free mem
  if (p_retMsg) goto error_cleanup_2;

  #if ESP32_SPI_Module_DBG >= 5
  SCDEFn_at_ESP32_SPI_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	5,
	"Definition '%.*s' (Module '%.*s') initializes SPI bus host. (MISO:%d, MOSI:%d, SCLK:%d, "
	"QUADWP:%d, QUADHD:%d, max.tx-size:%d.",
	p_ESP32_SPI_Definition->common.nameLen,
	p_ESP32_SPI_Definition->common.name,
	p_ESP32_SPI_Definition->common.module->provided->typeNameLen,
	p_ESP32_SPI_Definition->common.module->provided->typeName,
	p_bus_config->miso_io_num,
	p_bus_config->mosi_io_num,
	p_bus_config->sclk_io_num,
	p_bus_config->quadwp_io_num,
	p_bus_config->quadhd_io_num,
	p_bus_config->max_transfer_sz);
  #endif

/*
// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  p_parsedKVInput->requiredKVBF = ( (1 << ESP32_SPI_SET_I2C_NUM)
			        | (1 << ESP32_SPI_SET_I2C_MODE)
			        | (1 << ESP32_SPI_SET_SDA_IO)
			        | (1 << ESP32_SPI_SET_SDA_IO_PULLUP)
			        | (1 << ESP32_SPI_SET_SCL_IO)
			        | (1 << ESP32_SPI_SET_SCL_IO_PULLUP) );

  // set forbidden Keys -> Keys that are not allowed in this request
  p_parsedKVInput->forbiddenKVBF = 0;

  // process the set-args (key=value@) protocol
  if (ESP32_SPI_ProcessKVInputArgs(p_ESP32_SPI_Definition
    ,p_parsedKVInput				// KVInput parsed
    ,p_defArgsText				// our args text
    ,defArgsTextLen) ) {			// our args text len

    // Processing reports an problem. Args not taken. Response with error text.

    // alloc mem for retMsg
    p_retMsg = malloc(sizeof(strTextMultiple_t));

    // response with error text
    p_retMsg->strTextLen = asprintf(&retMsg->strText
      ,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
      ,defArgsTextLen
      ,p_defArgsText);

    // free allocated memory for query result key-field
    free(p_parsedKVInput);

    return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------
*/
  // set affected readings
 // ESP32_SPI_SetAffectedReadings(p_ESP32_SPI_Definition
  //  ,p_parsedKVInput->affectedReadingsBF);

// ------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  //free(p_parsedKVInput);


// ------------------------------------------------------------------------------------------------

  // set up 1st idle Callback
  p_ESP32_SPI_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;

  return p_retMsg;

// XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
// alternative end in case of errors - free all allocated things and return with retMsg as veto.

error_cleanup_2:

  // the ESP32_SPI_bus_config_t is allocated here
  free(p_ESP32_SPI_Definition->p_bus_config);

error_cleanup_1:
/*
  if (p_parsedKVInput) {

    free(p_parsedKVInput);

  }

*/
  return p_retMsg;
}




/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_SPI_DirectWrite
 *  Desc: for 2 stage designs - called to give write job to 1st stage (this stage)
 *  Info: 
 *  Para: ESP32_SPI_Definition_t *ESP32_SPI_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
/*
strTextMultiple_t *
ESP32_SPI_DirectWrite(
	 Common_Definition_t *Common_Definition_Stage1
	,Common_Definition_t *Common_Definition_Stage2
	,Common_StageXCHG_t *Common_StageXCHG)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;
  // to adress 1st stage definition - make common ptr to modul specific ptr
  ESP32_SPI_Definition_t *ESP32_SPI_Definition_Stage1 =
	(ESP32_SPI_Definition_t*) Common_Definition_Stage1;
  // make common ptr to modul specific ptr
  ESP32_SPI_StageXCHG_t *ESP32_SPI_StageXCHG =
	(ESP32_SPI_StageXCHG_t*) Common_StageXCHG;
// -------------------------------------------------------------------------------------------------
// check 4 matching modules
// -------------------------------------------------------------------------------------------------
// -------------------------------------------------------------------------------------------------
  #if ESP32_SPI_Module_DBG >= 5
  SCDEFn_at_ESP32_SPI_M->Log3Fn(
	 ESP32_SPI_Definition_Stage1->common.name
	,ESP32_SPI_Definition_Stage1->common.nameLen
	,5
	,"DirectWriteFn of Definition '%.*s' (Module '%.*s') is called "
  	 "from Definition '%.*s' (Module '%.*s') to exec write job."
	,ESP32_SPI_Definition_Stage1->common.nameLen
	,ESP32_SPI_Definition_Stage1->common.name
	,ESP32_SPI_Definition_Stage1->common.module->provided->typeNameLen
	,ESP32_SPI_Definition_Stage1->common.module->provided->typeName
	,Common_Definition_Stage2->nameLen
	,Common_Definition_Stage2->name
	,Common_Definition_Stage2->module->provided->typeNameLen
	,Common_Definition_Stage2->module->provided->typeName);
  #endif
// -------------------------------------------------------------------------------------------------
  return retMsg;
}
*/


/*
 * ------------------------------------------------------------------------------------------------
 *  FName: ESP32_SPI_IdleCb	
 *  Desc: Timed callback, X Hz, to do type dependend processing tasks.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled WebIf Definition 
 *  Rets: ? unclear char* -> response text NULL=no text
 * ------------------------------------------------------------------------------------------------
 */
int //feedModuleTask
ESP32_SPI_IdleCb(Common_Definition_t* p_Common_Definition)
{

  // make common ptr to modul specific ptr
  ESP32_SPI_Definition_t* p_ESP32_SPI_Definition =
		  (ESP32_SPI_Definition_t*) p_Common_Definition;

  // for Fn response msg
 // strTextMultiple_t* p_retMsg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 9
  SCDEFn_at_ESP32_SPI_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	9,
	"IdleCbFn is called (Module '%.*s').",
	p_ESP32_SPI_Definition->common.module->provided->typeNameLen,
	p_ESP32_SPI_Definition->common.module->provided->typeName);
  #endif

// ------------------------------------------------------------------------------------------------



