mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
  return retMsg;
}



/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_SPI_Undefine
 *  Desc: Removes the requested Definition of this Module. Includes executing type specific cleanup.
 *  Info: Invoked by cmd-line 'Undefine custom_definition_name'
 *  Para: Common_Definition_t* p_Common_Definition -> An Definition of this Module to remove (should be casted)
 *  Rets: strTextMultiple_t* -> p_retMsg (error text) -> forces VETO! ; NULL=SCDE_OK
 * --------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_SPI_Undefine(Common_Definition_t* p_Common_Definition)
{
  // make common ptr to modul specific ptr
  ESP32_SPI_Definition_t* p_ESP32_SPI_Definition =
	(ESP32_SPI_Definition_t*) p_Common_Definition;

  // for Fn response msg
  strTextMultiple_t* p_retMsg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_SPI_Module_DBG >= 5
  SCDEFn_at_ESP32_SPI_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	5,
	"UndefineFn is called (Module '%.*s'). Deleting this Definition.",
	p_ESP32_SPI_Definition->common.module->provided->typeNameLen,
	p_ESP32_SPI_Definition->common.module->provided->typeName);
  #endif

// ------------------------------------------------------------------------------------------------

  // Free this Definitions SPI bus / host
  if (p_ESP32_SPI_Definition) { 
	p_retMsg = ESP32_SPI_bus_free(p_ESP32_SPI_Definition);

	// an error occured, VETO, skip undefine
	if (p_retMsg) goto error_cancel_undefine_1;
  }

  // the ESP32_SPI_bus_config_t is allocated here
  free(p_ESP32_SPI_Definition->p_bus_config);

// XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

// alternative end in case of veto - stop undefine with error msg
error_cancel_undefine_1:

  return p_retMsg;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_SPI_Write
 *  Desc: Is called to write data to an 'Definition' of 'ESP32_SPI' Module.
 *  Info: 
 *  Para: Common_Definition_t* Common_Definition -> the 'Definition' that should write the data 
 *                                                  (cast to ESP32_SPI_Definition_t*)
 *        xString_t data          -> data that should be written (characters in allocated mem + len) 
 *  Rets: xMultipleStringSLTQE_t* -> response: ptr to an singly linked tail queue element with return
 *                                   message in allocated memory, or NULL = OK / No message
 * -------------------------------------------------------------------------------------------------
 */
xMultipleStringSLTQE_t*
ESP32_SPI_Write(Common_Definition_t *Common_Definition,
		       xString_t data)
{

  // make common ptr to modul specific ptr
  ESP32_SPI_Definition_t* ESP32_SPI_Definition =
		  (ESP32_SPI_Definition_t*) Common_Definition;

  // for Fn response msg
  xMultipleStringSLTQE_t *retMsgMultipleStringSLTQE = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_SPI_Module_DBG >= 7
  SCDEFn_at_ESP32_SPI_M->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,7
	,"WriteFn of Module '%.*s' is called for Definition '%.*s'. Got %d bytes raw data."
	,ESP32_SPI_Definition->common.module->provided->typeNameLen
	,ESP32_SPI_Definition->common.module->provided->typeName
	,ESP32_SPI_Definition->common.nameLen
	,ESP32_SPI_Definition->common.name
	,data.length);
  #endif

// -------------------------------------------------------------------------------------------------


  return retMsgMultipleStringSLTQE;
}


















/*
 * -------------------  helpers provided to module for type operation ------------------------------
 */



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_SPI_ProcessKVInputArgs
 *  Desc: Processes the KEY=VALUE input from Args. Information is pre-parsed to *parsedKVInput
 *  Info: .requiredKV -> Keys that should be there / .forbiddenKV -> Keys that are not allowed
 *  Para: ESP32_SPI_Definition_t *ESP32_SPI_Definition -> Definition that should get the input
 *        parsedKVInputArgs_t *parsedKVInput -> ptr to allocated mem filled with results from parse
 *        uint8_t *argsText -> the ArgsText
 *        size_t argsTextLen -> length of the ArgsText
 *  Rets: strTextMultiple_t* -> SCDE_OK, or error txts - for log
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_SPI_ProcessKVInputArgs(ESP32_SPI_Definition_t *ESP32_SPI_Definition,
	parsedKVInputArgs_t *parsedKVInput,
	uint8_t *argsText,
	size_t argsTextLen)
{
 printf("|0");
  // start without error
  strTextMultiple_t *retMsg = SCDE_OK;


 // remember the readings affected by the parsing process
  uint32_t affectedReadings = 0;

// -------------------------------------------------------------------------------------------------
// 1. Step: Create backup structures, if required mirror current effective values.
// -------------------------------------------------------------------------------------------------
/*
  // Block #01 Backup the current I2C-Block
  uint8_t new_i2c_num;
  new_i2c_num = ESP32_SPI_Definition->i2c_num;

// -------------------------------------------------------------------------------------------------

  // Block #02 Backup the current I2C mode
  i2c_mode_t new_i2c_mode;
  new_i2c_mode = ESP32_SPI_Definition->i2c_config.mode;

// -------------------------------------------------------------------------------------------------

  // Block #03 Backup the current SDA & SCL pin configuration used by I2C
  gpio_num_t new_sda_io_num;
  gpio_pullup_t new_sda_pullup_en;
  gpio_num_t new_scl_io_num;
  gpio_pullup_t new_scl_pullup_en;

  new_sda_io_num = ESP32_SPI_Definition->i2c_config.sda_io_num;
  new_sda_pullup_en = ESP32_SPI_Definition->i2c_config.sda_pullup_en;
  new_scl_io_num = ESP32_SPI_Definition->i2c_config.scl_io_num;
  new_scl_pullup_en = ESP32_SPI_Definition->i2c_config.scl_pullup_en;

// -------------------------------------------------------------------------------------------------

  // Block #04 Backup the current I2C clock speed
  uint32_t new_clk_speed;
  new_clk_speed = ESP32_SPI_Definition->i2c_config.master.clk_speed;

// -------------------------------------------------------------------------------------------------

  // Block #05 Backup the current setting for 10Bit adressing in slave mode
  uint8_t new_addr_10bit_en;
  new_addr_10bit_en = ESP32_SPI_Definition->i2c_config.slave.addr_10bit_en;

// -------------------------------------------------------------------------------------------------

  // Block #06 Backup the current I2C slave adress in slave
  uint8_t new_slave_addr;
  new_slave_addr = ESP32_SPI_Definition->i2c_config.slave.slave_addr;

// -------------------------------------------------------------------------------------------------
*/











// ------------------------------------------------------------------------------------------------
/*  
  // we need to process the 'Block' KEY in advance here, because we need this information early
  // Block=High_Speed|Low_Speed
  // -> Setzt den Hardware-PWM-Block des ESP32 (0=HighSpeed / 1= LowSpeed) der verwendet werden soll
  // -> Sets the hardware-PWM-Block of the ESP32 (0=HighSpeed / 1= LowSpeed) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SPI_SET_BLOCK) ) {
	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SPI_SET_BLOCK].off
		,parsedKVInput->keyData_t[ESP32_SPI_SET_BLOCK].len, &newBlock, ESP32_SPI_PWM_BLOCK)
		&& (newBlock <= 1) ) {
*/
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;
		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();
		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;
		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();
		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");
*/
/*
		}
	// invalid input detected ?
	else return true;
  }
*/
// ------------------------------------------------------------------------------------------------
  /*
  // we need to process the 'CHANNEL' KEY in advance here, because we need this information early
  // CHANNEL=[0-7]
  // -> Setzt den Hardware-PWM-Kanal des ESP32 (0-7) der verwendet werden soll
  // -> Sets the hardware-pwm-channel of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SPI_SET_CHANNEL) ) {
	// valid input happened ?
	if (SCDEH_GetDecUInt8Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SPI_SET_CHANNEL].off
		,parsedKVInput->keyData_t[ESP32_SPI_SET_CHANNEL].len, &newChannel) 
		&& (newChannel <= 7) ) {
*/
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;
		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();
		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;
		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();
		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");
*/
/*
		}
	// invalid input detected ?
	else return true;
  }
*/
// ------------------------------------------------------------------------------------------------
/*  
  // we need to process the 'TIMER' KEY in advance here, because we need this information early
  // TIMER=[0-3]
  // -> Setzt den Hardware-Timer f\FCr den gew\E4hlten PWM-Kanal des ESP32 (0-3) der verwendet werden soll
  // -> Sets the hardware-timer for the choosen pwm-channel of the ESP32 (0-3) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SPI_SET_TIMER) ) {
	// valid input happened ?
	if (SCDEH_GetDecUInt8Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SPI_SET_TIMER].off
		,parsedKVInput->keyData_t[ESP32_SPI_SET_TIMER].len, &newTimer) 
		&& (newTimer <= 3) ) {
*/
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;
		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();
		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;
		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();
		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");
*/
/*
		}
	// invalid input detected ?
	else return true;
  }
*/
// ------------------------------------------------------------------------------------------------
/*
  // block #4 get current assigned / connected GPIO
  uint8_t newGPIO = ESP32_SPI_Definition->GPIO;
  // block #5 reserve for new ATT
  uint32_t newATTVal;
  // block #6 reserve for new AVU
  char newAverageUnit[3];	
  // block #7  get ESP32 PWM channel configuration from selected channel
  // this stores our temp values
  ESP32_PWM_Channel_t newPWM_Channel;
  // pointer to make the hardware counters accessible
  ESP32_PWM_Channel_t *pPWM_Channel =
	(ESP32_PWM_Channel_t*) (0x3FF59000 + (0x14 * newChannel));
  // access low speed channels (instead of high speed channels)?
  if (newBlock) pPWM_Channel =
	(ESP32_PWM_Channel_t*) ( (uint8_t*) pPWM_Channel + 0xa0);
  // move data to temp storage
  memcpy(&newPWM_Channel, pPWM_Channel, sizeof(ESP32_PWM_Channel_t));
  // block #8  get ESP32 PWM timer configuration from selected timer
  // this stores our temp values
  ESP32_PWM_Timer_t newPWM_Timer;
  // pointer to make the hardware timers accessible
  ESP32_PWM_Timer_t *pPWM_Timer =
	(ESP32_PWM_Timer_t*) (0x3FF59140 + (0x08 * newTimer));
  // access low speed timers (instead of high speed timers)?
  if (newBlock) pPWM_Timer =
	(ESP32_PWM_Timer_t*) ( (uint8_t*) pPWM_Timer + 0x20);
  // move data to temp storage
  memcpy(&newPWM_Timer, pPWM_Timer, sizeof(ESP32_PWM_Timer_t));
  // store choosen timer in choosen channel
  newPWM_Channel.TIMER_SEL = newTimer;
*/



// ------------------------------------------------------------------------------------------------
// 2. Step: Process the possible input keys



// -------------------------------------------------------------------------------------------------
// I2C_NUM=[0-9] -> Setzt den I2C-Block der verwendet werden soll (0-1) 
// I2C_NUM=[0-9] -> Set the I2C-Block that should be used (0-1) 
/*
  if (parsedKVInput->keysFoundBF & (uint64_t) 1 << ESP32_SPI_SET_I2C_NUM) {

	uint8_t number;

