mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
    return true;
}



static bool 
bus_uses_iomux_pins(ESP32_SPI_host_device_t host,
	const ESP32_SPI_bus_config_t* bus_config)
{
    if (bus_config->sclk_io_num>=0 &&
        bus_config->sclk_io_num != spi_periph_signal[host].spiclk_iomux_pin) return false;
    if (bus_config->quadwp_io_num>=0 &&
        bus_config->quadwp_io_num != spi_periph_signal[host].spiwp_iomux_pin) return false;
    if (bus_config->quadhd_io_num>=0 &&
        bus_config->quadhd_io_num != spi_periph_signal[host].spihd_iomux_pin) return false;
    if (bus_config->mosi_io_num >= 0 &&
        bus_config->mosi_io_num != spi_periph_signal[host].spid_iomux_pin) return false;
    if (bus_config->miso_io_num>=0 &&
        bus_config->miso_io_num != spi_periph_signal[host].spiq_iomux_pin) return false;

return true;
}





/** to do: host not in use marker behaveior!
 * -------------------------------------------------------------------------------------------------
 *  FName: Bus Initialize IO
 *  Desc: Is called to do the common stuff to hook up a SPI host to a bus defined by a bunch of GPIO
 *        pins. Feed it a host number and a bus config struct and it'll set up the GPIO matrix and
 *        enable the device. If a pin is set to non-negative value, it should be able to be initialized.
 *  Info: 
 *  Para: ESP32_SPI_Definition_t* ESP32_SPI_Definition -> the 'Definition' that should init its SPI IO  
 *        ESP32_SPI_host_device_t host_device -> the SPI pheriperal that this Definitions spi-host should use
 *        const ESP32_SPI_bus_config_t *bus_config -> the configuration to set up
 *        int dma_chan ->
 *        uint32_t flags ->
 *        uint32_t* flags_o ->
 *  Rets: strTextMultiple_t* -> response: ptr to an singly linked tail queue element with return
 *                              message (error!) in allocated memory, or NULL = SCDE_OK / NO error message
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* 
ESP32_SPI_common_bus_initialize_io(ESP32_SPI_Definition_t* ESP32_SPI_Definition,
	ESP32_SPI_host_device_t host_device,
	const ESP32_SPI_bus_config_t *bus_config,
	int dma_chan,
	uint32_t flags,
	uint32_t* flags_o)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = SCDE_OK;

  uint32_t temp_flag = 0;

  bool miso_need_output;
  bool mosi_need_output;
  bool sclk_need_output;

  if ( ( flags & SPICOMMON_BUSFLAG_MASTER ) != 0 ) {

	// initial for master
        miso_need_output = ((flags&SPICOMMON_BUSFLAG_DUAL) != 0) ? true : false;
        mosi_need_output = true;
        sclk_need_output = true;

  } else {

	// initial for slave
	miso_need_output = true;
        mosi_need_output = ( ( flags & SPICOMMON_BUSFLAG_DUAL ) != 0 ) ? true : false;
        sclk_need_output = false;
  }

  const bool wp_need_output = true;
  const bool hd_need_output = true;

  // check pin capabilities
  if ( bus_config->sclk_io_num >= 0 ) {

	temp_flag |= SPICOMMON_BUSFLAG_SCLK;
	SCDE_CHECK_LOADERRORTXT_RET(GPIO_IS_VALID_OUTPUT_GPIO(bus_config->sclk_io_num),
		"SCLK is no valid output GPIO");
  }

  if ( bus_config->quadwp_io_num >= 0 ) {

	SCDE_CHECK_LOADERRORTXT_RET(GPIO_IS_VALID_OUTPUT_GPIO(bus_config->quadwp_io_num),
		"WP is no valid output GPIO");
  }

    if ( bus_config->quadhd_io_num >= 0 ) {

	SCDE_CHECK_LOADERRORTXT_RET(GPIO_IS_VALID_OUTPUT_GPIO(bus_config->quadhd_io_num),
		"HD is no valid output GPIO");
  }

  // set flags for QUAD mode according to the existence of wp and hd
  if ( bus_config->quadhd_io_num >= 0 && bus_config->quadwp_io_num >= 0 ) temp_flag |= SPICOMMON_BUSFLAG_WPHD;

  if ( bus_config->mosi_io_num >= 0 ) {

	temp_flag |= SPICOMMON_BUSFLAG_MOSI;

	SCDE_CHECK_LOADERRORTXT_RET(GPIO_IS_VALID_OUTPUT_GPIO(bus_config->quadhd_io_num),
		"MOSI is no valid output GPIO");
    }

  if ( bus_config->miso_io_num >= 0 ) {

	temp_flag |= SPICOMMON_BUSFLAG_MISO;

	SCDE_CHECK_LOADERRORTXT_RET(GPIO_IS_VALID_OUTPUT_GPIO(bus_config->miso_io_num),
		"MISO is no valid output GPIO");
  }

  // set flags for DUAL mode according to output-capability of MOSI and MISO pins.
  if ( (bus_config->mosi_io_num < 0 || GPIO_IS_VALID_OUTPUT_GPIO(bus_config->mosi_io_num)) &&
	(bus_config->miso_io_num < 0 || GPIO_IS_VALID_OUTPUT_GPIO(bus_config->miso_io_num)) ) {

	temp_flag |= SPICOMMON_BUSFLAG_DUAL;
  }

  // check if the selected pins correspond to the iomux pins of the peripheral
  bool use_iomux = bus_uses_iomux_pins(host_device, bus_config);

  if ( use_iomux ) temp_flag |= SPICOMMON_BUSFLAG_NATIVE_PINS;

  uint32_t missing_flag = flags & ~temp_flag;

  missing_flag &= ~SPICOMMON_BUSFLAG_MASTER;	//don't check this flag

  if ( missing_flag != 0 ) {

	//check pins existence
	if (missing_flag & SPICOMMON_BUSFLAG_SCLK) {

		#if ESP32_DeVICE_Module_DBG >= 1
		SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
			,ESP32_SPI_ProvidedByModule.common.typeNameLen
			,1
			,"sclk pin required!");
		#endif
	}

	if (missing_flag & SPICOMMON_BUSFLAG_MOSI) {

		#if ESP32_DeVICE_Module_DBG >= 1
		SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
			,ESP32_SPI_ProvidedByModule.common.typeNameLen
			,1
			,"mosi pin required!");
		#endif
	}

	if (missing_flag & SPICOMMON_BUSFLAG_MISO) {

		#if ESP32_DeVICE_Module_DBG >= 1
		SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
			,ESP32_SPI_ProvidedByModule.common.typeNameLen
			,1
			,"miso pin required!");
		#endif
	}

	if (missing_flag & SPICOMMON_BUSFLAG_DUAL) {

		#if ESP32_DeVICE_Module_DBG >= 1
		SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
			,ESP32_SPI_ProvidedByModule.common.typeNameLen
			,1
			,"not both mosi and miso output capable!");
		#endif
	}

	if (missing_flag & SPICOMMON_BUSFLAG_WPHD) {

		#if ESP32_DeVICE_Module_DBG >= 1
		SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
			,ESP32_SPI_ProvidedByModule.common.typeNameLen
			,1
			,"both wp and hd required!");
		#endif
	}

