mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
	if (missing_flag & SPICOMMON_BUSFLAG_NATIVE_PINS) {

		#if ESP32_DeVICE_Module_DBG >= 1
		SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
			,ESP32_SPI_ProvidedByModule.common.typeNameLen
			,1
			,"not using iomux pins!");
		#endif
	}

	SCDE_CHECK_LOADERRORTXT_RET(missing_flag == 0, "Not all required capabilities satisfied. Details in Debug-Log");
  }

  if ( use_iomux ) {

	// All SPI iomux pin selections resolve to 1, so we put that here instead of trying to figure
	// out which FUNC_GPIOx_xSPIxx to grab; they all are defined to 1 anyway.
	#if ESP32_DeVICE_Module_DBG >= 5
	SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
		,ESP32_SPI_ProvidedByModule.common.typeNameLen
		,5
		,"SPI%d uses iomux pins."
		,host_device + 1);
	#endif

	if ( bus_config->mosi_io_num >= 0 ) {
		gpio_iomux_in(bus_config->mosi_io_num, spi_periph_signal[host_device].spid_in);
		gpio_iomux_out(bus_config->mosi_io_num, FUNC_SPI, false);
	}

	if ( bus_config->miso_io_num >= 0 ) {
		gpio_iomux_in(bus_config->miso_io_num, spi_periph_signal[host_device].spiq_in);
		gpio_iomux_out(bus_config->miso_io_num, FUNC_SPI, false);
	}

	if ( bus_config->quadwp_io_num >= 0 ) {
		gpio_iomux_in(bus_config->quadwp_io_num, spi_periph_signal[host_device].spiwp_in);
		gpio_iomux_out(bus_config->quadwp_io_num, FUNC_SPI, false);
	}

	if ( bus_config->quadhd_io_num >= 0 ) {
		gpio_iomux_in(bus_config->quadhd_io_num, spi_periph_signal[host_device].spihd_in);
		gpio_iomux_out(bus_config->quadhd_io_num, FUNC_SPI, false);
	}

	if ( bus_config->sclk_io_num >= 0 ) {
		gpio_iomux_in(bus_config->sclk_io_num, spi_periph_signal[host_device].spiclk_in);
		gpio_iomux_out(bus_config->sclk_io_num, FUNC_SPI, false);
	}

	temp_flag |= SPICOMMON_BUSFLAG_NATIVE_PINS;

  } else {

	// Use GPIO matrix
	#if ESP32_DeVICE_Module_DBG >= 5
	SCDEFn_at_ESP32_SPI_M->Log3Fn(ESP32_SPI_ProvidedByModule.common.typeName
		,ESP32_SPI_ProvidedByModule.common.typeNameLen
		,5
		,"SPI%d uses gpio matrix."
		,host_device + 1);
	#endif

	if ( bus_config->mosi_io_num >= 0 ) {

		if (mosi_need_output || (temp_flag&SPICOMMON_BUSFLAG_DUAL)) {

		gpio_set_direction(bus_config->mosi_io_num, GPIO_MODE_INPUT_OUTPUT);

		gpio_matrix_out(bus_config->mosi_io_num, spi_periph_signal[host_device].spid_out, false, false);

	} else {

		gpio_set_direction(bus_config->mosi_io_num, GPIO_MODE_INPUT);
	}

	gpio_matrix_in(bus_config->mosi_io_num, spi_periph_signal[host_device].spid_in, false);

	PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[bus_config->mosi_io_num], FUNC_GPIO);
  }

  if ( bus_config->miso_io_num >= 0 ) {

	if (miso_need_output || (temp_flag & SPICOMMON_BUSFLAG_DUAL)) {

		gpio_set_direction(bus_config->miso_io_num, GPIO_MODE_INPUT_OUTPUT);

		gpio_matrix_out(bus_config->miso_io_num, spi_periph_signal[host_device].spiq_out, false, false);

	} else {

		gpio_set_direction(bus_config->miso_io_num, GPIO_MODE_INPUT);
	}

	gpio_matrix_in(bus_config->miso_io_num, spi_periph_signal[host_device].spiq_in, false);

	PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[bus_config->miso_io_num], FUNC_GPIO);
  }

  if ( bus_config->quadwp_io_num >= 0) {

	gpio_set_direction(bus_config->quadwp_io_num, GPIO_MODE_INPUT_OUTPUT);

	gpio_matrix_out(bus_config->quadwp_io_num, spi_periph_signal[host_device].spiwp_out, false, false);

	gpio_matrix_in(bus_config->quadwp_io_num, spi_periph_signal[host_device].spiwp_in, false);

	PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[bus_config->quadwp_io_num], FUNC_GPIO);

  }

  if ( bus_config->quadhd_io_num >= 0) {

	gpio_set_direction(bus_config->quadhd_io_num, GPIO_MODE_INPUT_OUTPUT);

	gpio_matrix_out(bus_config->quadhd_io_num, spi_periph_signal[host_device].spihd_out, false, false);

	gpio_matrix_in(bus_config->quadhd_io_num, spi_periph_signal[host_device].spihd_in, false);

	PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[bus_config->quadhd_io_num], FUNC_GPIO);
  }

  if (bus_config->sclk_io_num >= 0) {

		if (sclk_need_output) {

			gpio_set_direction(bus_config->sclk_io_num, GPIO_MODE_INPUT_OUTPUT);

			gpio_matrix_out(bus_config->sclk_io_num, spi_periph_signal[host_device].spiclk_out, false, false);

		} else {

			gpio_set_direction(bus_config->sclk_io_num, GPIO_MODE_INPUT);
		}

		gpio_matrix_in(bus_config->sclk_io_num, spi_periph_signal[host_device].spiclk_in, false);

		PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[bus_config->sclk_io_num], FUNC_GPIO);
	}
  }

  // Select DMA channel.
  DPORT_SET_PERI_REG_BITS(DPORT_SPI_DMA_CHAN_SEL_REG, 3, dma_chan, (host_device * 2));

  if (flags_o) *flags_o = temp_flag;

  return retMsg;
}



//Find any pin with output muxed to ``func`` and reset it to GPIO
static void 
reset_func_to_gpio(int func)
{
    for (int x = 0; x < GPIO_PIN_COUNT; x++) {
        if (GPIO_IS_VALID_GPIO(x) && (READ_PERI_REG(GPIO_FUNC0_OUT_SEL_CFG_REG + (x * 4))&GPIO_FUNC0_OUT_SEL_M) == func)  {
            gpio_matrix_out(x, SIG_GPIO_OUT_IDX, false, false);
        }
    }
}



esp_err_t 
ESP32_SPI_common_bus_free_io(ESP32_SPI_host_device_t host)
{
    if (REG_GET_FIELD(GPIO_PIN_MUX_REG[spi_periph_signal[host].spid_iomux_pin], MCU_SEL) == 1) PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[spi_periph_signal[host].spid_iomux_pin], PIN_FUNC_GPIO);
    if (REG_GET_FIELD(GPIO_PIN_MUX_REG[spi_periph_signal[host].spiq_iomux_pin], MCU_SEL) == 1) PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[spi_periph_signal[host].spiq_iomux_pin], PIN_FUNC_GPIO);
    if (REG_GET_FIELD(GPIO_PIN_MUX_REG[spi_periph_signal[host].spiclk_iomux_pin], MCU_SEL) == 1) PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[spi_periph_signal[host].spiclk_iomux_pin], PIN_FUNC_GPIO);
    if (REG_GET_FIELD(GPIO_PIN_MUX_REG[spi_periph_signal[host].spiwp_iomux_pin], MCU_SEL) == 1) PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[spi_periph_signal[host].spiwp_iomux_pin], PIN_FUNC_GPIO);
    if (REG_GET_FIELD(GPIO_PIN_MUX_REG[spi_periph_signal[host].spihd_iomux_pin], MCU_SEL) == 1) PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[spi_periph_signal[host].spihd_iomux_pin], PIN_FUNC_GPIO);
    reset_func_to_gpio(spi_periph_signal[host].spid_out);
    reset_func_to_gpio(spi_periph_signal[host].spiq_out);
    reset_func_to_gpio(spi_periph_signal[host].spiclk_out);
    reset_func_to_gpio(spi_periph_signal[host].spiwp_out);
    reset_func_to_gpio(spi_periph_signal[host].spihd_out);
    return ESP_OK;
}



esp_err_t 
ESP32_SPI_common_bus_free_io_cfg(const ESP32_SPI_bus_config_t *bus_cfg)
{
    int pin_array[] = {
        bus_cfg->mosi_io_num,
        bus_cfg->miso_io_num,
        bus_cfg->sclk_io_num,
        bus_cfg->quadwp_io_num,
        bus_cfg->quadhd_io_num,
    };
    for (int i = 0; i < sizeof(pin_array)/sizeof(int); i ++) {
        const int io = pin_array[i];
        if (io >= 0 && GPIO_IS_VALID_GPIO(io)) gpio_reset_pin(io);
    }
    return ESP_OK;
}




void 
ESP32_SPI_common_cs_initialize(ESP32_SPI_host_device_t host,
	int cs_io_num,
	int cs_num,
	int force_gpio_matrix)
{
    if (!force_gpio_matrix && cs_io_num == spi_periph_signal[host].spics0_iomux_pin && cs_num == 0) {
        //The cs0s for all SPI peripherals map to pin mux source 1, so we use that instead of a define.
        gpio_iomux_in(cs_io_num, spi_periph_signal[host].spics_in);
        gpio_iomux_out(cs_io_num, FUNC_SPI, false);
    } else {
        //Use GPIO matrix
        if (GPIO_IS_VALID_OUTPUT_GPIO(cs_io_num)) {
            gpio_set_direction(cs_io_num, GPIO_MODE_INPUT_OUTPUT);
            gpio_matrix_out(cs_io_num, spi_periph_signal[host].spics_out[cs_num], false, false);
        } else {
            gpio_set_direction(cs_io_num, GPIO_MODE_INPUT);
        }
        if (cs_num == 0) gpio_matrix_in(cs_io_num, spi_periph_signal[host].spics_in, false);
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[cs_io_num], FUNC_GPIO);
    }
}



void 
ESP32_SPI_common_cs_free(ESP32_SPI_host_device_t host,
	int cs_io_num)
{
    if (cs_io_num == 0 && REG_GET_FIELD(GPIO_PIN_MUX_REG[spi_periph_signal[host].spics0_iomux_pin], MCU_SEL) == 1) {
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[spi_periph_signal[host].spics0_iomux_pin], PIN_FUNC_GPIO);
    }
    reset_func_to_gpio(spi_periph_signal[host].spics_out[cs_io_num]);
}



void 
ESP32_SPI_common_cs_free_io(int cs_gpio_num)
{
    assert(cs_gpio_num>=0 && GPIO_IS_VALID_GPIO(cs_gpio_num));
    gpio_reset_pin(cs_gpio_num);
}



// Set up a list of dma descriptors. dmadesc is an array of descriptors. Data is the buffer to point to.
void IRAM_ATTR 
ESP32_SPI_common_setup_dma_desc_links(lldesc_t *dmadesc,
	int len,
	const uint8_t *data,
	bool isrx)
{
    int n = 0;
    while (len) {
        int dmachunklen = len;
        if (dmachunklen > SPI_MAX_DMA_LEN) dmachunklen = SPI_MAX_DMA_LEN;
        if (isrx) {
            //Receive needs DMA length rounded to next 32-bit boundary
            dmadesc[n].size = (dmachunklen + 3) & (~3);
            dmadesc[n].length = (dmachunklen + 3) & (~3);
        } else {
            dmadesc[n].size = dmachunklen;
            dmadesc[n].length = dmachunklen;
        }
        dmadesc[n].buf = (uint8_t *)data;
        dmadesc[n].eof = 0;
        dmadesc[n].sosf = 0;
        dmadesc[n].owner = 1;
        dmadesc[n].qe.stqe_next = &dmadesc[n + 1];
        len -= dmachunklen;
        data += dmachunklen;
        n++;
    }
    dmadesc[n - 1].eof = 1; //Mark last DMA desc as end of stream.
    dmadesc[n - 1].qe.stqe_next = NULL;
}


