mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
#ifdef CONFIG_SPI_MASTER_ISR_IN_IRAM
#define SPI_MASTER_ISR_ATTR IRAM_ATTR
#else
#define SPI_MASTER_ISR_ATTR
#endif

#ifdef CONFIG_SPI_MASTER_IN_IRAM
#define SPI_MASTER_ATTR IRAM_ATTR
#else
#define SPI_MASTER_ATTR
#endif



//static ESP32_SPI_host_t *spihost[3];

static void spi_intr(void *arg);





/** to do: host not in use marker behaveior!
 * -------------------------------------------------------------------------------------------------
 *  FName: Bus Initialize
 *  Desc: Is called to initializes / allocates this Definitions spi-bus host (ESP32_SPI_host_t host)
 *  Info: 
 *  Para: ESP32_SPI_Definition_t* ESP32_SPI_Definition -> the 'Definition' that should init its SPI host  
 *        ESP32_SPI_host_device_t host_device -> the SPI pheriperal that this Definitions spi-host should use
 *  Rets: strTextMultiple_t* -> response: ptr to an singly linked tail queue element with return
 *                              message (error!) in allocated memory, or NULL = SCDE_OK / NO error message
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_SPI_bus_initialize(ESP32_SPI_Definition_t* ESP32_SPI_Definition,
	ESP32_SPI_host_device_t host_device,
	const ESP32_SPI_bus_config_t* bus_config,
	int dma_chan)
{
  // for Fn response msg
  strTextMultiple_t* retMsg = SCDE_OK;

  bool spi_chan_claimed, dma_chan_claimed;

  /* ToDo: remove this when we have flash operations cooperating with this */
  SCDE_CHECK_LOADERRORTXT_RET(host_device != SPI_HOST,
	"SPI1 as peripheral for 'Host_Device' is not supported");

  SCDE_CHECK_LOADERRORTXT_RET(host_device >= SPI_HOST && host_device <= VSPI_HOST,
	"Invalid SPI peripheral selected for 'Host_Device'");

  SCDE_CHECK_LOADERRORTXT_RET(dma_chan >= 0 && dma_chan <= 2,
	"Invalid dma channel");

  SCDE_CHECK_LOADERRORTXT_RET( (bus_config->intr_flags & (ESP_INTR_FLAG_HIGH|ESP_INTR_FLAG_EDGE|ESP_INTR_FLAG_INTRDISABLED) ) == 0,
	 "Intr flag not allowed");

  #ifndef CONFIG_SPI_MASTER_ISR_IN_IRAM
  SCDE_CHECK_LOADERRORTXT_RET( ( bus_config->intr_flags & ESP_INTR_FLAG_IRAM ) == 0, "ESP_INTR_FLAG_IRAM should be disabled when CONFIG_SPI_MASTER_ISR_IN_IRAM is not set");
  #endif

  spi_chan_claimed = ESP32_SPI_common_periph_claim(host_device, "spi master");

  SCDE_CHECK_LOADERRORTXT_RET(spi_chan_claimed, "Host already in use");

  if ( dma_chan != 0 ) {

	dma_chan_claimed = ESP32_SPI_common_dma_chan_claim(dma_chan);

	if ( !dma_chan_claimed ) {

		ESP32_SPI_common_periph_free( host_device );

		SCDE_CHECK_LOADERRORTXT_RET(false, "DMA channel already in use");
	}
  }

  // alloc ESP32_SPI_host_t
  ESP32_SPI_host_t* host = malloc(sizeof(ESP32_SPI_host_t));

  // we got the mem?
  if ( host == NULL ) {

 	SCDE_CHECK_LOADERRORTXT(false, "Could not alloc 'ESP32_SPI_host_t'");

        goto cleanup;
  }

  // store ptr in this Definitions ESP32_SPI_Definition_t
  ESP32_SPI_Definition->p_host = host;

  // zero the memory
  memset(host, 0, sizeof(ESP32_SPI_host_t));

  // store the host-pheriperal this Definition is using
   host->host_device = host_device;

  // store the bus config for ?
  memcpy( &host->bus_cfg, bus_config, sizeof(ESP32_SPI_bus_config_t));

  #ifdef CONFIG_PM_ENABLE
  retMsg = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "spi_master",
            &host->pm_lock);

  if (retMsg) goto cleanup;

  #endif //CONFIG_PM_ENABLE

  retMsg = ESP32_SPI_common_bus_initialize_io(ESP32_SPI_Definition, host_device,
	bus_config, dma_chan, SPICOMMON_BUSFLAG_MASTER|bus_config->flags, &host->flags);

  if (retMsg) goto cleanup;

  host->dma_chan = dma_chan;

  if ( dma_chan == 0 ) {

	host->max_transfer_sz = 64;
  }

  else {

	// See how many dma descriptors we need and allocate them
	int dma_desc_ct = (bus_config->max_transfer_sz + SPI_MAX_DMA_LEN -1) / SPI_MAX_DMA_LEN;

	// default to 4k when max is not given
	if ( dma_desc_ct == 0 ) dma_desc_ct = 1; 

        host->max_transfer_sz = dma_desc_ct * SPI_MAX_DMA_LEN;
        host->dmadesc_tx = heap_caps_malloc(sizeof(lldesc_t) * dma_desc_ct, MALLOC_CAP_DMA);
        host->dmadesc_rx = heap_caps_malloc(sizeof(lldesc_t) * dma_desc_ct, MALLOC_CAP_DMA);

        if ( !host->dmadesc_tx || !host->dmadesc_rx ) {

		SCDE_CHECK_LOADERRORTXT(false, "Out of memory");

		goto cleanup;
	}
  }

  int flags = bus_config->intr_flags | ESP_INTR_FLAG_INTRDISABLED;

 esp_err_t err = esp_intr_alloc(ESP32_SPI_common_irqsource_for_host(host_device),
	flags, spi_intr, (void*) host, &host->intr);

  if (err != ESP_OK) {

	SCDE_CHECK_LOADERRORTXT(false, "got error from Fn 'esp_intr_alloc'");

	goto cleanup;
  }

  host->hw = ESP32_SPI_common_hw_for_host(host_device);

  host->cur_cs = NO_CS;
  host->prev_cs = NO_CS;
  atomic_store(&host->acquire_cs, NO_CS);
  host->polling = false;
  host->isr_free = true;
  host->bus_locked = false;

  // Reset DMA
  host->hw->dma_conf.val |= SPI_OUT_RST|SPI_IN_RST|SPI_AHBM_RST|SPI_AHBM_FIFO_RST;
  host->hw->dma_out_link.start = 0;
  host->hw->dma_in_link.start =0;
  host->hw->dma_conf.val &= ~(SPI_OUT_RST|SPI_IN_RST|SPI_AHBM_RST|SPI_AHBM_FIFO_RST);

  // Reset timing
  host->hw->ctrl2.val = 0;

  // master use all 64 bytes of the buffer
  host->hw->user.usr_miso_highpart = 0;
  host->hw->user.usr_mosi_highpart = 0;

  // Disable unneeded ints
  host->hw->slave.rd_buf_done = 0;
  host->hw->slave.wr_buf_done = 0;
  host->hw->slave.rd_sta_done = 0;
  host->hw->slave.wr_sta_done = 0;
  host->hw->slave.rd_buf_inten = 0;
  host->hw->slave.wr_buf_inten = 0;
  host->hw->slave.rd_sta_inten = 0;
  host->hw->slave.wr_sta_inten = 0;

  // Force a transaction done interrupt. This interrupt won't fire yet because we initialized the SPI interrupt as
  // disabled.  This way, we can just enable the SPI interrupt and the interrupt handler will kick in, handling
  // any transactions that are queued.
  host->hw->slave.trans_inten = 1;
  host->hw->slave.trans_done = 1;

