mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
  return retMsg;

cleanup:
  free(host->dmadesc_tx);
  free(host->dmadesc_rx);

  #ifdef CONFIG_PM_ENABLE
  if (host[host_device]->pm_lock) {

	esp_pm_lock_delete(host[host_device]->pm_lock);
  }
  #endif

  ESP32_SPI_common_periph_free(host_device);

  ESP32_SPI_common_dma_chan_free(dma_chan);

  return retMsg;
}



/** to do: host not in use marker behaveior!
 * -------------------------------------------------------------------------------------------------
 *  FName: Bus Free
 *  Desc: Is called to deinitialize / free this Definitions spi-bus host (ESP32_SPI_host_t host)
 *  Info: 
 *  Para: ESP32_SPI_Definition_t* ESP32_SPI_Definition -> the 'Definition' that should free its SPI host  
 *  Rets: strTextMultiple_t* -> response: ptr to an singly linked tail queue element with return
 *                              message (error!) in allocated memory, or NULL = SCDE_OK / NO error message
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* 
ESP32_SPI_bus_free(ESP32_SPI_Definition_t* ESP32_SPI_Definition)
{
  // for Fn response msg
  strTextMultiple_t* retMsg = SCDE_OK;

  int x;

  // get ptr to ESP32_SPI_host_t in this Definitions ESP32_SPI_Definition_t
  ESP32_SPI_host_t* host = ESP32_SPI_Definition->p_host;

  ESP32_SPI_host_device_t host_device = host->host_device;

  SCDE_CHECK_LOADERRORTXT_RET(host_device >= SPI_HOST && host_device <= VSPI_HOST,
	"Host_Device' pheriperal out of range");

//  SCDE_CHECK_LOADERRORTXT_RET(host[host_device] != NULL,
//	 "host was not in use");

  for ( x = 0 ; x < NO_CS ; x++ ) {

	SCDE_CHECK_LOADERRORTXT_RET(atomic_load(&host->device[x]) == NULL,
		"Not all CSses freed at this host");
  }

  ESP32_SPI_common_bus_free_io_cfg(&host->bus_cfg);

  if ( host->dma_chan > 0 ) {

	ESP32_SPI_common_dma_chan_free(host->dma_chan);
  }

  #ifdef CONFIG_PM_ENABLE
  esp_pm_lock_delete(host->pm_lock);
  #endif

  host->hw->slave.trans_inten=0;
  host->hw->slave.trans_done=0;

  esp_intr_free(host->intr);

  ESP32_SPI_common_periph_free(host_device);

  free(host->dmadesc_tx);

  free(host->dmadesc_rx);

  free(host);

  host = NULL;

  return retMsg;
}




void ESP32_SPI_get_timing(bool gpio_is_used,
	int input_delay_ns,
	int eff_clk,
	int* dummy_o,
	int* cycles_remain_o)
{
    const int apbclk_kHz = APB_CLK_FREQ/1000;
    //calculate how many apb clocks a period has
    const int apbclk_n = APB_CLK_FREQ/eff_clk;
    const int gpio_delay_ns = gpio_is_used ? 25 : 0;

    //calculate how many apb clocks the delay is, the 1 is to compensate in case ``input_delay_ns`` is rounded off.
    int apb_period_n = (1 + input_delay_ns + gpio_delay_ns)*apbclk_kHz/1000/1000;
    if (apb_period_n < 0) apb_period_n = 0;

    int dummy_required = apb_period_n/apbclk_n;

    int miso_delay = 0;
    if (dummy_required > 0) {
        //due to the clock delay between master and slave, there's a range in which data is random
        //give MISO a delay if needed to make sure we sample at the time MISO is stable
        miso_delay = (dummy_required+1)*apbclk_n-apb_period_n-1;
    } else {
        //if the dummy is not required, maybe we should also delay half a SPI clock if the data comes too early
        if (apb_period_n*4 <= apbclk_n) miso_delay = -1;
    }
    if (dummy_o!=NULL) *dummy_o = dummy_required;
    if (cycles_remain_o!=NULL) *cycles_remain_o = miso_delay;

    ESP_LOGD(SPI_TAG,"eff: %d, limit: %dk(/%d), %d dummy, %d delay", eff_clk/1000, apbclk_kHz/(apb_period_n+1), apb_period_n, dummy_required, miso_delay);
}



int ESP32_SPI_get_freq_limit(bool gpio_is_used,
	int input_delay_ns)
{
    const int apbclk_kHz = APB_CLK_FREQ/1000;
    const int gpio_delay_ns = gpio_is_used ? 25 : 0;

    //calculate how many apb clocks the delay is, the 1 is to compensate in case ``input_delay_ns`` is rounded off.
    int apb_period_n = (1 + input_delay_ns + gpio_delay_ns)*apbclk_kHz/1000/1000;
    if (apb_period_n < 0) apb_period_n = 0;

    return APB_CLK_FREQ/(apb_period_n+1);
}




/** to do: Host not initialized marker + check here + marker init host initialize/uninitialize
 * -------------------------------------------------------------------------------------------------
 *  FName: Add Device
 *  Desc: Is called to add an spi-device. This allocates a CS line for the device, allocates memory
 *        for the device structure and hooks up the CS pin to whatever is specified.
 *  Info: 
 *  Para: ESP32_SPI_Definition_t* ESP32_SPI_Definition -> the 'Definition' that should add a device
 *                                                        to its SPI host
 *        const ESP32_SPI_device_interface_config_t* dev_config -> the device interface configuration
 *        ESP32_SPI_device_handle_t* handle -> location in memory where the handle should be stored
 *  Rets: strTextMultiple_t* -> response: ptr to an singly linked tail queue element with return
 *                              message (error!) in allocated memory, or NULL = SCDE_OK / NO error message
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*  
ESP32_SPI_bus_add_device(ESP32_SPI_Definition_t* ESP32_SPI_Definition,
	const ESP32_SPI_device_interface_config_t* dev_config,
	ESP32_SPI_device_handle_t* handle)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = SCDE_OK;

  // create adressing-ptr to this Definitions Host
  ESP32_SPI_host_t* host = ESP32_SPI_Definition->p_host;

  // assigned spi-pheriperal
  ESP32_SPI_host_device_t host_device = host->host_device;

  int freecs;
  int apbclk=APB_CLK_FREQ;
  int eff_clk;
  int duty_cycle;
  int dummy_required;
  int miso_delay;

  ESP32_SPI_clock_reg_t clk_reg;

  SCDE_CHECK_LOADERRORTXT_RET(host_device >= SPI_HOST && host_device <= VSPI_HOST,
	 "Device to add has invalid host");

//x  SCDE_CHECK_LOADERRORTXT_RET(host[host_device] != NULL,
//	 "Device to add has not initialized host");

