mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
  SCDE_CHECK_LOADERRORTXT_RET(dev_config->spics_io_num < 0 || GPIO_IS_VALID_OUTPUT_GPIO(dev_config->spics_io_num),
	 "Device to add has invalid Spics pin");

  SCDE_CHECK_LOADERRORTXT_RET(dev_config->clock_speed_hz > 0,
	"Device to add has invalid invalid sclk speed");

  for ( freecs = 0 ; freecs < NO_CS; freecs++ ) {

        // See if this slot is free; reserve if it is by putting a dummy pointer in the slot.
	//  We use an atomic compare&swap to make this thread-safe.
	void* null = NULL;
	if ( atomic_compare_exchange_strong(&host->device[freecs], &null, (spi_device_t *) 1) ) break;
  }

  SCDE_CHECK_LOADERRORTXT_RET(freecs != NO_CS,
	"Device to add has no free cs pins at host");

  // The hardware looks like it would support this, but actually setting cs_ena_pretrans when transferring in full
  // duplex mode does absolutely nothing on the ESP32.
  SCDE_CHECK_LOADERRORTXT_RET(dev_config->cs_ena_pretrans <= 1 ||
			    (dev_config->address_bits == 0 &&
			     dev_config->command_bits == 0) ||
       			    (dev_config->flags & SPI_DEVICE_HALFDUPLEX),
		"In full-duplex mode, only support cs pretrans delay = 1 and without address_bits and command_bits");

  duty_cycle = (dev_config->duty_cycle_pos == 0) ? 128 : dev_config->duty_cycle_pos;

  eff_clk = ESP32_SPI_cal_clock(apbclk, dev_config->clock_speed_hz, duty_cycle, (uint32_t*) &clk_reg);

  int freq_limit = ESP32_SPI_get_freq_limit(!(host->flags&SPICOMMON_BUSFLAG_NATIVE_PINS),
	 dev_config->input_delay_ns);

  // Speed >=40MHz over GPIO matrix needs a dummy cycle, but these don't work for full-duplex connections.
  ESP32_SPI_get_timing(!(host->flags&SPICOMMON_BUSFLAG_NATIVE_PINS),
	dev_config->input_delay_ns,
	eff_clk,
	&dummy_required,
	&miso_delay);


  SCDE_CHECK_LOADERRORTXT_RET2(dev_config->flags & SPI_DEVICE_HALFDUPLEX || dummy_required == 0 || dev_config->flags & SPI_DEVICE_NO_DUMMY,
	"When work in full-duplex mode at frequency > %.1fMHz, device cannot read correct data.\n\
	Try to use IOMUX pins to increase the frequency limit, or use the half duplex mode.\n\
	Please note the SPI master can only work at divisors of 80MHz, and the driver always tries to find the closest frequency to your 	configuration.\n\
	Specify ``SPI_DEVICE_NO_DUMMY`` to ignore this checking. Then you can output data at higher speed, or read data at your own risk.",
            freq_limit/1000./1000 );

  // allocate memory for device
  ESP32_SPI_device_t *dev = malloc(sizeof(ESP32_SPI_device_t));

  // alloc failed ?
  if ( dev == NULL ) goto nomem;

  // start clean ...
  memset(dev, 0, sizeof(ESP32_SPI_device_t));

  // now init struct ...
  atomic_store(&host->device[freecs], dev);

  // will we need a link to the definition?
//  dev->ESP32_SPI_Definition = ESP32_SPI_Definition;

  dev->id = freecs;

  dev->waiting = false;

  // allocate queues, set defaults
  dev->trans_queue = xQueueCreate(dev_config->queue_size, sizeof(ESP32_SPI_trans_priv_t));
  dev->ret_queue = xQueueCreate(dev_config->queue_size, sizeof(ESP32_SPI_trans_priv_t));
  dev->semphr_polling = xSemaphoreCreateBinary();

  if (!dev->trans_queue || !dev->ret_queue || !dev->semphr_polling) {

	goto nomem;
  }

  dev->host = host;

  // we want to save a copy of the dev config in the dev struct.
  memcpy(&dev->cfg, dev_config, sizeof(ESP32_SPI_device_interface_config_t));

  dev->cfg.duty_cycle_pos = duty_cycle;

  // TODO: if we have to change the apb clock among transactions, re-calculate this each time the apb clock lock is acquired.
  dev->clk_cfg= (clock_config_t) {
	.eff_clk = eff_clk,
	.dummy_num = dummy_required,
	.reg = clk_reg,
	.miso_delay = miso_delay,
  };

  // Set CS pin, CS options
  if (dev_config->spics_io_num >= 0) {

	ESP32_SPI_common_cs_initialize(host_device, dev_config->spics_io_num, freecs, !(host->flags&SPICOMMON_BUSFLAG_NATIVE_PINS));
  }

  if (dev_config->flags&SPI_DEVICE_CLK_AS_CS) {

	host->hw->pin.master_ck_sel |= (1<<freecs);
  }

  else {

	host->hw->pin.master_ck_sel &= (1<<freecs);
  }

  if (dev_config->flags&SPI_DEVICE_POSITIVE_CS) {

	host->hw->pin.master_cs_pol |= (1<<freecs);
  }

  else {

	host->hw->pin.master_cs_pol &= (1<<freecs);
  }

  host->hw->ctrl2.mosi_delay_mode = 0;
  host->hw->ctrl2.mosi_delay_num = 0;

  *handle = dev;

  ESP_LOGD(SPI_TAG, "(@ SPI peripheral %d): New device added to CS%d, effective clock: %dkHz",
	host_device + 1,
	freecs,
	dev->clk_cfg.eff_clk/1000);

  return retMsg;

// abort in case of no mem here
nomem:
  if (dev) {

	if (dev->trans_queue) vQueueDelete(dev->trans_queue);

	if (dev->ret_queue) vQueueDelete(dev->ret_queue);

	if (dev->semphr_polling) vSemaphoreDelete(dev->semphr_polling);
  }

  free(dev);

  return retMsg;
}



strTextMultiple_t* 
ESP32_SPI_bus_remove_device(ESP32_SPI_device_handle_t handle)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = SCDE_OK;

  int x;

  SCDE_CHECK_LOADERRORTXT_RET(handle != NULL,
	"Device handle is invalid");

  SCDE_CHECK_LOADERRORTXT_RET(uxQueueMessagesWaiting(handle->trans_queue) == 0,
	"Invalid State. Unfinished transactions");

  SCDE_CHECK_LOADERRORTXT_RET(handle->host->cur_cs == NO_CS || atomic_load(&handle->host->device[handle->host->cur_cs]) != handle,
	"Invalid State. Unfinished transactions");

  SCDE_CHECK_LOADERRORTXT_RET(uxQueueMessagesWaiting(handle->ret_queue) ==0,
	"Invalid State. Unfinished transactions");

  // return
  int spics_io_num = handle->cfg.spics_io_num;

  if ( spics_io_num >= 0 ) ESP32_SPI_common_cs_free_io(spics_io_num);

  // Kill queues
  vQueueDelete(handle->trans_queue);
  vQueueDelete(handle->ret_queue);
  vSemaphoreDelete(handle->semphr_polling);

  // Remove device from list of csses and free memory
  for ( x = 0 ; x < NO_CS ; x++ ) {

	if ( atomic_load(&handle->host->device[x] ) == handle ) {

		atomic_store(&handle->host->device[x], NULL);

		if ( x == handle->host->prev_cs ) handle->host->prev_cs = NO_CS;
	}
  }

