mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
  free(handle);

  return retMsg;
}



static int ESP32_SPI_freq_for_pre_n(int fapb, int pre, int n)
{
    return (fapb / (pre * n));
}

int ESP32_SPI_cal_clock(int fapb, int hz, int duty_cycle, uint32_t *reg_o)
{
    ESP32_SPI_clock_reg_t reg;
    int eff_clk;

    //In hw, n, h and l are 1-64, pre is 1-8K. Value written to register is one lower than used value.
    if (hz>((fapb/4)*3)) {
        //Using Fapb directly will give us the best result here.
        reg.clkcnt_l=0;
        reg.clkcnt_h=0;
        reg.clkcnt_n=0;
        reg.clkdiv_pre=0;
        reg.clk_equ_sysclk=1;
        eff_clk=fapb;
    } else {
        //For best duty cycle resolution, we want n to be as close to 32 as possible, but
        //we also need a pre/n combo that gets us as close as possible to the intended freq.
        //To do this, we bruteforce n and calculate the best pre to go along with that.
        //If there's a choice between pre/n combos that give the same result, use the one
        //with the higher n.
        int pre, n, h, l;
        int bestn=-1;
        int bestpre=-1;
        int besterr=0;
        int errval;
        for (n=2; n<=64; n++) { //Start at 2: we need to be able to set h/l so we have at least one high and one low pulse.
            //Effectively, this does pre=round((fapb/n)/hz).
            pre=((fapb/n)+(hz/2))/hz;
            if (pre<=0) pre=1;
            if (pre>8192) pre=8192;
            errval=abs(ESP32_SPI_freq_for_pre_n(fapb, pre, n)-hz);
            if (bestn==-1 || errval<=besterr) {
                besterr=errval;
                bestn=n;
                bestpre=pre;
            }
        }

        n=bestn;
        pre=bestpre;
        l=n;
        //This effectively does round((duty_cycle*n)/256)
        h=(duty_cycle*n+127)/256;
        if (h<=0) h=1;

        reg.clk_equ_sysclk=0;
        reg.clkcnt_n=n-1;
        reg.clkdiv_pre=pre-1;
        reg.clkcnt_h=h-1;
        reg.clkcnt_l=l-1;
        eff_clk=ESP32_SPI_freq_for_pre_n(fapb, pre, n);
    }
    if (reg_o != NULL) *reg_o = reg.val;
    return eff_clk;
}

/*
 * Set the spi clock according to pre-calculated register value.
 */
static inline void SPI_MASTER_ISR_ATTR ESP32_SPI_set_clock(spi_dev_t *hw, spi_clock_reg_t reg)
{
    hw->clock.val = reg.val;
}

// Setup the device-specified configuration registers. Called every time a new
// transaction is to be sent, but only apply new configurations when the device
// changes.
static void SPI_MASTER_ISR_ATTR 
ESP32_SPI_setup_device(ESP32_SPI_host_t *host, int dev_id )
{
  // if the configuration is already applied, skip the following.
  if (dev_id == host->prev_cs) {

	return;
  }

  ESP_EARLY_LOGD(SPI_TAG, "SPI device changed from %d to %d", host->prev_cs, dev_id);

  ESP32_SPI_device_t *dev = atomic_load(&host->device[dev_id]);

  // Configure clock settings
  ESP32_SPI_set_clock(host->hw, dev->clk_cfg.reg);

  // Configure bit order
  host->hw->ctrl.rd_bit_order=(dev->cfg.flags & SPI_DEVICE_RXBIT_LSBFIRST) ? 1 : 0;
  host->hw->ctrl.wr_bit_order=(dev->cfg.flags & SPI_DEVICE_TXBIT_LSBFIRST) ? 1 : 0;

  // Configure polarity
  if (dev->cfg.mode == 0) {

	host->hw->pin.ck_idle_edge=0;
	host->hw->user.ck_out_edge=0;
  }

  else if (dev->cfg.mode==1) {

	host->hw->pin.ck_idle_edge=0;
	host->hw->user.ck_out_edge=1;
  }

  else if (dev->cfg.mode==2) {

	host->hw->pin.ck_idle_edge=1;
	host->hw->user.ck_out_edge=1;
  }

  else if (dev->cfg.mode==3) {

	host->hw->pin.ck_idle_edge=1;
	host->hw->user.ck_out_edge=0;
  }

  // Configure misc stuff
  host->hw->user.doutdin=(dev->cfg.flags & SPI_DEVICE_HALFDUPLEX) ? 0 : 1;
  host->hw->user.sio=(dev->cfg.flags & SPI_DEVICE_3WIRE) ? 1 : 0;

  // Configure CS pin and timing
  host->hw->ctrl2.setup_time=dev->cfg.cs_ena_pretrans-1;
  host->hw->user.cs_setup=dev->cfg.cs_ena_pretrans ? 1 : 0;

  // set hold_time to 0 will not actually append delay to CS
  // set it to 1 since we do need at least one clock of hold time in most cases
  host->hw->ctrl2.hold_time=dev->cfg.cs_ena_posttrans;
  if (host->hw->ctrl2.hold_time == 0) host->hw->ctrl2.hold_time = 1;
  host->hw->user.cs_hold=1;

  host->hw->pin.cs0_dis = (dev_id == 0) ? 0 : 1;
  host->hw->pin.cs1_dis = (dev_id == 1) ? 0 : 1;
  host->hw->pin.cs2_dis = (dev_id == 2) ? 0 : 1;

  //Record the device just configured to save time for next time
  host->prev_cs = dev_id;
}

/*-----------------------------------------------------------------------------
    Arbitration Functions
-----------------------------------------------------------------------------*/

static inline void spi_isr_invoke(ESP32_SPI_device_t *dev)
{
    int acquire_cs = atomic_load(&dev->host->acquire_cs);
    if (acquire_cs == dev->id || acquire_cs == NO_CS) {
        esp_intr_enable(dev->host->intr);
    }
    //otherwise wait for bus release to invoke
}

/*  This function try to race for the arbitration between devices.
 *  Even if this returns successfully, the ISR may be still running.
 *  Call device_wait_for_isr_idle to make sure the ISR is done.
 */
static SPI_MASTER_ISR_ATTR esp_err_t 
device_acquire_bus_internal(ESP32_SPI_device_t *handle, TickType_t wait)
{
    ESP32_SPI_host_t *host = handle->host;
    SPI_CHECK(wait==portMAX_DELAY, "acquire finite time not supported now.", ESP_ERR_INVALID_ARG);

    if (atomic_load(&host->acquire_cs) == handle->id) {
        // Quickly skip if the bus is already acquired.
        // Usually this is only when the bus is locked.
        assert(host->bus_locked);
        return ESP_OK;
    } else {
        // Declare we are waiting for the bus so that if we get blocked later, other device or the ISR will yield to us after their using.
        handle->waiting = true;
        // Clear the semaphore before checking
        xSemaphoreTake(handle->semphr_polling, 0);

        int no_cs = NO_CS;
        atomic_compare_exchange_weak(&host->acquire_cs, &no_cs, handle->id);
        if (atomic_load(&host->acquire_cs) != handle->id) {
            //block until the bus is acquired (help by other task)
            BaseType_t ret = xSemaphoreTake(handle->semphr_polling, wait);
            //TODO: add timeout handling here.
            if (ret == pdFALSE) return ESP_ERR_TIMEOUT;
        }
        handle->waiting = false;
    }
    return ESP_OK;
}

/*  This function check for whether the ISR is done, if not, block until semaphore given.
 */
static inline SPI_MASTER_ISR_ATTR 
esp_err_t 
device_wait_for_isr_idle(ESP32_SPI_device_t *handle, TickType_t wait)
{
    //quickly skip if the isr is already free
    if (!handle->host->isr_free) {
        // Clear the semaphore before checking
        xSemaphoreTake(handle->semphr_polling, 0);
        if (!handle->host->isr_free) {
            //block until the the isr is free and give us the semaphore
            BaseType_t ret = xSemaphoreTake(handle->semphr_polling, wait);
            //TODO: add timeout handling here.
            if (ret == pdFALSE) return ESP_ERR_TIMEOUT;
        }
    }
    return ESP_OK;
}

