mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
/*  This function release the bus acquired by device_acquire_internal.
    And it also tries to help other device to acquire the bus.
    If the bus acquring is not needed, it goes through all device queues to see whether to invoke the ISR
 */
static SPI_MASTER_ISR_ATTR void device_release_bus_internal(ESP32_SPI_host_t *host)
{
    //release the bus
    atomic_store(&host->acquire_cs, NO_CS);
    //first try to restore the acquiring device
    for (int i = 0; i < NO_CS; i++) {
        //search for all registered devices
        ESP32_SPI_device_t* dev = atomic_load(&host->device[i]);
        if (dev && dev->waiting) {
            int no_cs = NO_CS;
            atomic_compare_exchange_weak(&host->acquire_cs, &no_cs, i);
            if (atomic_load(&host->acquire_cs) == i) {
                // Success to acquire for new device
                BaseType_t ret = uxQueueMessagesWaiting(dev->trans_queue);
                if (ret > 0) {
                    // If there are transactions in the queue, the ISR should be invoked first
                    // Resume the interrupt to send the task a signal
                    spi_isr_invoke(dev);
                } else {
                    // Otherwise resume the task directly.
                    xSemaphoreGive(dev->semphr_polling);
                }
            }
            return;
        }
    }
    //if no devices waiting, searching in device queues to see whether to recover the ISR
    for( int i = 0; i < NO_CS; i++) {
        ESP32_SPI_device_t *dev = atomic_load(&host->device[i]);
        if (dev == NULL) continue;
        BaseType_t ret = uxQueueMessagesWaiting(dev->trans_queue);
        if ( ret != 0) {
            spi_isr_invoke(dev);
            return;
        }
    }
}

static inline SPI_MASTER_ISR_ATTR bool device_is_polling(ESP32_SPI_device_t *handle)
{
    return atomic_load(&handle->host->acquire_cs) == handle->id && handle->host->polling;
}

/*-----------------------------------------------------------------------------
    Working Functions
-----------------------------------------------------------------------------*/

// The function is called to send a new transaction, in ISR or in the task.
// Setup the transaction-specified registers and linked-list used by the DMA (or FIFO if DMA is not used)
static void SPI_MASTER_ISR_ATTR 
spi_new_trans(ESP32_SPI_device_t *dev, ESP32_SPI_trans_priv_t *trans_buf)
{
    ESP32_SPI_transaction_t *trans = NULL;
    ESP32_SPI_host_t *host = dev->host;
    int dev_id = dev->id;

    //clear int bit
    host->hw->slave.trans_done = 0;

    trans = trans_buf->trans;
    host->cur_cs = dev_id;
    //We should be done with the transmission.
    assert(host->hw->cmd.usr == 0);

    //Reconfigure according to device settings, the function only has effect when the dev_id is changed.
    ESP32_SPI_setup_device(host, dev_id);

    //Reset DMA peripheral
    host->hw->dma_conf.val |= SPI_OUT_RST|SPI_IN_RST|SPI_AHBM_RST|SPI_AHBM_FIFO_RST;
    host->hw->dma_out_link.start=0;
    host->hw->dma_in_link.start=0;
    host->hw->dma_conf.val &= ~(SPI_OUT_RST|SPI_IN_RST|SPI_AHBM_RST|SPI_AHBM_FIFO_RST);
    host->hw->dma_conf.out_data_burst_en=1;
    host->hw->dma_conf.indscr_burst_en=1;
    host->hw->dma_conf.outdscr_burst_en=1;
    //Set up QIO/DIO if needed
    host->hw->ctrl.val &= ~(SPI_FREAD_DUAL|SPI_FREAD_QUAD|SPI_FREAD_DIO|SPI_FREAD_QIO);
    host->hw->user.val &= ~(SPI_FWRITE_DUAL|SPI_FWRITE_QUAD|SPI_FWRITE_DIO|SPI_FWRITE_QIO);
    if (trans->flags & SPI_TRANS_MODE_DIO) {
        if (trans->flags & SPI_TRANS_MODE_DIOQIO_ADDR) {
            host->hw->ctrl.fread_dio=1;
            host->hw->user.fwrite_dio=1;
        } else {
            host->hw->ctrl.fread_dual=1;
            host->hw->user.fwrite_dual=1;
        }
        host->hw->ctrl.fastrd_mode=1;
    } else if (trans->flags & SPI_TRANS_MODE_QIO) {
        if (trans->flags & SPI_TRANS_MODE_DIOQIO_ADDR) {
            host->hw->ctrl.fread_qio=1;
            host->hw->user.fwrite_qio=1;
        } else {
            host->hw->ctrl.fread_quad=1;
            host->hw->user.fwrite_quad=1;
        }
        host->hw->ctrl.fastrd_mode=1;
    }

    //Fill DMA descriptors
    int extra_dummy=0;
    if (trans_buf->buffer_to_rcv) {
        if (host->dma_chan == 0) {
            //No need to setup anything; we'll copy the result out of the work registers directly later.
        } else {
            ESP32_SPI_common_setup_dma_desc_links(host->dmadesc_rx, ((trans->rxlength+7)/8), (uint8_t*)trans_buf->buffer_to_rcv, true);
            host->hw->dma_in_link.addr=(int)(&host->dmadesc_rx[0]) & 0xFFFFF;
            host->hw->dma_in_link.start=1;
        }
        //when no_dummy is not set and in half-duplex mode, sets the dummy bit if RX phase exist
        if (((dev->cfg.flags&SPI_DEVICE_NO_DUMMY)==0) && (dev->cfg.flags&SPI_DEVICE_HALFDUPLEX)) {
            extra_dummy=dev->clk_cfg.dummy_num;
        }
    } else {
        //DMA temporary workaround: let RX DMA work somehow to avoid the issue in ESP32 v0/v1 silicon
        if (host->dma_chan != 0 ) {
            host->hw->dma_in_link.addr=0;
            host->hw->dma_in_link.start=1;
        }
    }

    if (trans_buf->buffer_to_send) {
        if (host->dma_chan == 0) {
            //Need to copy data to registers manually
            for (int x=0; x < trans->length; x+=32) {
                //Use memcpy to get around alignment issues for txdata
                uint32_t word;
                memcpy(&word, &trans_buf->buffer_to_send[x/32], 4);
                host->hw->data_buf[(x/32)]=word;
            }
        } else {
            ESP32_SPI_common_setup_dma_desc_links(host->dmadesc_tx, (trans->length+7)/8, (uint8_t*)trans_buf->buffer_to_send, false);
            host->hw->dma_out_link.addr=(int)(&host->dmadesc_tx[0]) & 0xFFFFF;
            host->hw->dma_out_link.start=1;
        }
    }

    //SPI iface needs to be configured for a delay in some cases.
    //configure dummy bits
    host->hw->user.usr_dummy=(dev->cfg.dummy_bits+extra_dummy) ? 1 : 0;
    host->hw->user1.usr_dummy_cyclelen=dev->cfg.dummy_bits+extra_dummy-1;

