mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
    int miso_long_delay = 0;
    if (dev->clk_cfg.miso_delay<0) {
        //if the data comes too late, delay half a SPI clock to improve reading
        miso_long_delay = 1;
        host->hw->ctrl2.miso_delay_num = 0;
    } else {
        //if the data is so fast that dummy_bit is used, delay some apb clocks to meet the timing
        host->hw->ctrl2.miso_delay_num = extra_dummy ? dev->clk_cfg.miso_delay : 0;
    }

    if (miso_long_delay) {
        switch (dev->cfg.mode) {
        case 0:
            host->hw->ctrl2.miso_delay_mode = 2;
            break;
        case 1:
            host->hw->ctrl2.miso_delay_mode = 1;
            break;
        case 2:
            host->hw->ctrl2.miso_delay_mode = 1;
            break;
        case 3:
            host->hw->ctrl2.miso_delay_mode = 2;
            break;
        }
    } else {
        host->hw->ctrl2.miso_delay_mode = 0;
    }

    host->hw->mosi_dlen.usr_mosi_dbitlen=trans->length-1;
    if ( dev->cfg.flags & SPI_DEVICE_HALFDUPLEX ) {
        host->hw->miso_dlen.usr_miso_dbitlen=trans->rxlength-1;
    } else {
        //rxlength is not used in full-duplex mode
        host->hw->miso_dlen.usr_miso_dbitlen=trans->length-1;
    }

    //Configure bit sizes, load addr and command
    int cmdlen;
    int addrlen;
    if (!(dev->cfg.flags & SPI_DEVICE_HALFDUPLEX) && dev->cfg.cs_ena_pretrans != 0) {
        /* The command and address phase is not compatible with cs_ena_pretrans
         * in full duplex mode.
         */
        cmdlen = 0;
        addrlen = 0;
    } else {
        if (trans->flags & SPI_TRANS_VARIABLE_CMD) {
            cmdlen = ((ESP32_SPI_transaction_ext_t *)trans)->command_bits;
        } else {
            cmdlen = dev->cfg.command_bits;
        }
        if (trans->flags & SPI_TRANS_VARIABLE_ADDR) {
            addrlen = ((ESP32_SPI_transaction_ext_t *)trans)->address_bits;
        } else {
            addrlen = dev->cfg.address_bits;
        }
    }

    host->hw->user1.usr_addr_bitlen=addrlen-1;
    host->hw->user2.usr_command_bitlen=cmdlen-1;
    host->hw->user.usr_addr=addrlen ? 1 : 0;
    host->hw->user.usr_command=cmdlen ? 1 : 0;

    if ((dev->cfg.flags & SPI_DEVICE_TXBIT_LSBFIRST)==0) {
        /* Output command will be sent from bit 7 to 0 of command_value, and
         * then bit 15 to 8 of the same register field. Shift and swap to send
         * more straightly.
         */
        host->hw->user2.usr_command_value = SPI_SWAP_DATA_TX(trans->cmd, cmdlen);

        // shift the address to MSB of addr (and maybe slv_wr_status) register.
        // output address will be sent from MSB to LSB of addr register, then comes the MSB to LSB of slv_wr_status register.
        if (addrlen > 32) {
            host->hw->addr = trans->addr >> (addrlen - 32);
            host->hw->slv_wr_status = trans->addr << (64 - addrlen);
        } else {
            host->hw->addr = trans->addr << (32 - addrlen);
        }
    } else {
        /* The output command start from bit0 to bit 15, kept as is.
         * The output address start from the LSB of the highest byte, i.e.
         * addr[24] -> addr[31]
         * ...
         * addr[0] -> addr[7]
         * slv_wr_status[24] -> slv_wr_status[31]
         * ...
         * slv_wr_status[0] -> slv_wr_status[7]
         * So swap the byte order to let the LSB sent first.
         */
        host->hw->user2.usr_command_value = trans->cmd;
        uint64_t addr = __builtin_bswap64(trans->addr);
        host->hw->addr = addr>>32;
        host->hw->slv_wr_status = addr;
    }

    if ((!(dev->cfg.flags & SPI_DEVICE_HALFDUPLEX) && trans_buf->buffer_to_rcv) ||
        trans_buf->buffer_to_send) {
        host->hw->user.usr_mosi = 1;
    } else {
        host->hw->user.usr_mosi = 0;
    }
    host->hw->user.usr_miso = (trans_buf->buffer_to_rcv) ? 1 : 0;

    //Call pre-transmission callback, if any
    if (dev->cfg.pre_cb) dev->cfg.pre_cb(trans);
    //Kick off transfer
    host->hw->cmd.usr=1;
}

// The function is called when a transaction is done, in ISR or in the task.
// Fetch the data from FIFO and call the ``post_cb``.
static void SPI_MASTER_ISR_ATTR 
ESP32_SPI_post_trans(ESP32_SPI_host_t *host)
{
  ESP32_SPI_transaction_t *cur_trans = host->cur_trans_buf.trans;

  if (host->cur_trans_buf.buffer_to_rcv && host->dma_chan == 0 ) {

	// Need to copy from SPI regs to result buffer.
	for (int x = 0; x < cur_trans->rxlength; x += 32) {

		// Do a memcpy to get around possible alignment issues in rx_buffer
		uint32_t word = host->hw->data_buf[x / 32];

		int len = cur_trans->rxlength - x;

		if (len > 32) len = 32;

		memcpy(&host->cur_trans_buf.buffer_to_rcv[x / 32], &word, (len + 7) / 8);
	}
  }

  // Call post-transaction callback, if any
  ESP32_SPI_device_t* dev = atomic_load(&host->device[host->cur_cs]);
  if (dev->cfg.post_cb) dev->cfg.post_cb(cur_trans);

  host->cur_cs = NO_CS;
}



// This is run in interrupt context.
static void SPI_MASTER_ISR_ATTR spi_intr(void *arg)
{
    int i;
    BaseType_t r;
    BaseType_t do_yield = pdFALSE;
    ESP32_SPI_host_t *host = (ESP32_SPI_host_t *)arg;

    assert(host->hw->slave.trans_done == 1);

    /*------------ deal with the in-flight transaction -----------------*/
    if (host->cur_cs != NO_CS) {
        //Okay, transaction is done.
        const int cs = host->cur_cs;
        //Tell common code DMA workaround that our DMA channel is idle. If needed, the code will do a DMA reset.
        if (host->dma_chan) {
            ESP32_SPI_common_dmaworkaround_idle(host->dma_chan);
        }

        //cur_cs is changed to NO_CS here
        ESP32_SPI_post_trans(host);
        //Return transaction descriptor.
        xQueueSendFromISR(atomic_load(&host->device[cs])->ret_queue, &host->cur_trans_buf, &do_yield);
#ifdef CONFIG_PM_ENABLE
        //Release APB frequency lock
        esp_pm_lock_release(host->pm_lock);
#endif
    }

