mattehicks/SCDE/components/ESP32_SPI_Module/ESP32_SPI_Module.c
        memcpy( temp, send_ptr, (trans_desc->length + 7) / 8 );
        send_ptr = temp;
        }
    new_desc->buffer_to_send = send_ptr;

    return ESP_OK;

clean_up:
    uninstall_priv_desc(new_desc);
    return ESP_ERR_NO_MEM;
}

esp_err_t SPI_MASTER_ATTR ESP32_SPI_device_queue_trans(ESP32_SPI_device_handle_t handle, ESP32_SPI_transaction_t *trans_desc,  TickType_t ticks_to_wait)
{
    esp_err_t ret = check_trans_valid(handle, trans_desc);
    if (ret != ESP_OK) return ret;

    ESP32_SPI_host_t *host = handle->host;

    SPI_CHECK( !device_is_polling(handle), "Cannot queue new transaction while previous polling transaction is not terminated.", ESP_ERR_INVALID_STATE );

    ESP32_SPI_trans_priv_t trans_buf;
    ret = setup_priv_desc(trans_desc, &trans_buf, (host->dma_chan!=0));
    if (ret != ESP_OK) return ret;

#ifdef CONFIG_PM_ENABLE
    esp_pm_lock_acquire(host->pm_lock);
#endif
    //Send to queue and invoke the ISR.

    BaseType_t r = xQueueSend(handle->trans_queue, (void *)&trans_buf, ticks_to_wait);
    if (!r) {
        ret = ESP_ERR_TIMEOUT;
#ifdef CONFIG_PM_ENABLE
        //Release APB frequency lock
        esp_pm_lock_release(host->pm_lock);
#endif
        goto clean_up;
    }
    spi_isr_invoke(handle);
    return ESP_OK;

clean_up:
    uninstall_priv_desc(&trans_buf);
    return ret;
}

esp_err_t SPI_MASTER_ATTR ESP32_SPI_device_get_trans_result(ESP32_SPI_device_handle_t handle, ESP32_SPI_transaction_t **trans_desc, TickType_t ticks_to_wait)
{
    BaseType_t r;
    ESP32_SPI_trans_priv_t trans_buf;
    SPI_CHECK(handle!=NULL, "invalid dev handle", ESP_ERR_INVALID_ARG);

    //use the interrupt, block until return
    r=xQueueReceive(handle->ret_queue, (void*)&trans_buf, ticks_to_wait);
    if (!r) {
        // The memory occupied by rx and tx DMA buffer destroyed only when receiving from the queue (transaction finished).
        // If timeout, wait and retry.
        // Every in-flight transaction request occupies internal memory as DMA buffer if needed.
        return ESP_ERR_TIMEOUT;
    }
    //release temporary buffers
    uninstall_priv_desc(&trans_buf);
    (*trans_desc) = trans_buf.trans;

    return ESP_OK;
}

//Porcelain to do one blocking transmission.
esp_err_t SPI_MASTER_ATTR ESP32_SPI_device_transmit(ESP32_SPI_device_handle_t handle, ESP32_SPI_transaction_t *trans_desc)
{
    esp_err_t ret;
    ESP32_SPI_transaction_t *ret_trans;
    //ToDo: check if any spi transfers in flight
    ret = ESP32_SPI_device_queue_trans(handle, trans_desc, portMAX_DELAY);
    if (ret != ESP_OK) return ret;

    ret = ESP32_SPI_device_get_trans_result(handle, &ret_trans, portMAX_DELAY);
    if (ret != ESP_OK) return ret;

    assert(ret_trans == trans_desc);
    return ESP_OK;
}

esp_err_t SPI_MASTER_ATTR 
ESP32_SPI_device_acquire_bus(ESP32_SPI_device_t *device, TickType_t wait)
{
    ESP32_SPI_host_t *const host = device->host;
    SPI_CHECK(wait==portMAX_DELAY, "acquire finite time not supported now.", ESP_ERR_INVALID_ARG);
    SPI_CHECK( !device_is_polling(device), "Cannot acquire bus when a polling transaction is in progress.", ESP_ERR_INVALID_STATE );

    esp_err_t ret = device_acquire_bus_internal(device, portMAX_DELAY);
    if (ret != ESP_OK) return ret;
    ret = device_wait_for_isr_idle(device, portMAX_DELAY);
    if (ret != ESP_OK) return ret;

    device->host->bus_locked = true;

    ESP_LOGD(SPI_TAG, "device%d acquired the bus", device->id);

#ifdef CONFIG_PM_ENABLE
    // though we don't suggest to block the task before ``release_bus``, still allow doing so.
    // this keeps the spi clock at 80MHz even if all tasks are blocked
    esp_pm_lock_acquire(device->host->pm_lock);
#endif
    //configure the device so that we don't need to do it again in the following transactions
    ESP32_SPI_setup_device( host, device->id );
    //the DMA is also occupied by the device, all the slave devices that using DMA should wait until bus released.
    if (host->dma_chan != 0) {
        ESP32_SPI_common_dmaworkaround_transfer_active(host->dma_chan);
    }
    return ESP_OK;
}

// This function restore configurations required in the non-polling mode
void SPI_MASTER_ATTR ESP32_SPI_device_release_bus(ESP32_SPI_device_t *dev)
{
    ESP32_SPI_host_t *host = dev->host;

    if (device_is_polling(dev)){
        ESP_LOGE(SPI_TAG, "Cannot release bus when a polling transaction is in progress.");
        assert(0);
    }

    if (host->dma_chan != 0) {
        ESP32_SPI_common_dmaworkaround_idle(host->dma_chan);
    }
    //Tell common code DMA workaround that our DMA channel is idle. If needed, the code will do a DMA reset.

    //allow clock to be lower than 80MHz when all tasks blocked
#ifdef CONFIG_PM_ENABLE
    //Release APB frequency lock
    esp_pm_lock_release(host->pm_lock);
#endif
    ESP_LOGD(SPI_TAG, "device%d release bus", dev->id);

    dev->host->bus_locked = false;
    device_release_bus_internal(dev->host);
}



esp_err_t SPI_MASTER_ISR_ATTR 
ESP32_SPI_device_polling_start(ESP32_SPI_device_handle_t handle,
	ESP32_SPI_transaction_t *trans_desc,
	TickType_t ticks_to_wait)
{
  esp_err_t ret;
  SPI_CHECK(ticks_to_wait == portMAX_DELAY, "currently timeout is not available for polling transactions", ESP_ERR_INVALID_ARG);

  ESP32_SPI_host_t *host = handle->host;

  ret = check_trans_valid(handle, trans_desc);

  if (ret != ESP_OK) return ret;

  SPI_CHECK( !device_is_polling(handle), "Cannot send polling transaction while the previous polling transaction is not terminated.", ESP_ERR_INVALID_STATE );

  ret = setup_priv_desc(trans_desc, &host->cur_trans_buf, (handle->host->dma_chan!=0));
  if (ret!=ESP_OK) return ret;

  device_acquire_bus_internal(handle, portMAX_DELAY);

  device_wait_for_isr_idle(handle, portMAX_DELAY);

  assert(atomic_load(&host->acquire_cs) == handle->id);
  assert(host->isr_free);

  // Polling, no interrupt is used.
  host->polling = true;

  ESP_LOGV(SPI_TAG, "polling trans");

  spi_new_trans(handle, &host->cur_trans_buf);

  return ESP_OK;
}



esp_err_t SPI_MASTER_ISR_ATTR 
ESP32_SPI_device_polling_end(ESP32_SPI_device_handle_t handle,
	TickType_t ticks_to_wait)
{
  SPI_CHECK(handle != NULL, "invalid dev handle", ESP_ERR_INVALID_ARG);

  ESP32_SPI_host_t *host = handle->host;

  // if (host->acquire_cs == handle->id && host->polling) {
  assert(host->cur_cs == atomic_load(&host->acquire_cs));
  TickType_t start = xTaskGetTickCount();

  while (!host->hw->slave.trans_done) {

	TickType_t end = xTaskGetTickCount();
	if (end - start > ticks_to_wait) {
		return ESP_ERR_TIMEOUT;
	}
  }

  ESP_LOGV(SPI_TAG, "polling trans done");

  // deal with the in-flight transaction
  ESP32_SPI_post_trans(host);

  // release temporary buffers
  uninstall_priv_desc(&host->cur_trans_buf);

  host->polling = false;

  if (!host->bus_locked) {

	device_release_bus_internal(host);
  }

  return ESP_OK;
}



esp_err_t SPI_MASTER_ISR_ATTR 
ESP32_SPI_device_polling_transmit(ESP32_SPI_device_handle_t handle,
	ESP32_SPI_transaction_t* trans_desc)
{
  esp_err_t ret;
  ret = ESP32_SPI_device_polling_start(handle, trans_desc, portMAX_DELAY);

  if (ret != ESP_OK) return ret;

  ret = ESP32_SPI_device_polling_end(handle, portMAX_DELAY);

  if (ret != ESP_OK) return ret;

  return ESP_OK;
}










